{
  "config": {
    "base_path": "docs/planes/material/sylvarus/locations/cities",
    "template": "_templates/city_template.md"
  },
  "items": {
    "Redwater": {
      "auto_link_strings": [
        "Redwater"
      ],
      "name": "Redwater",
      "type": "City",
      "nation": "Kingdom of Titanrock",
      "region": "Western Titanrock in the Pheonix Peninsula",
      "population": "52,000",
      "known_for": "The Pit of Champions arena, enchantment gemstone mines, bustling port network, beautiful sunsets",
      "founding_epoch": "Pre-Phoenix War",
      "ruling_power": "Kingdom of Titanrock",
      "government_type": "Royal Governor",
      "song_link": "",
      "song_name": "Bloodborne OST - The Hunter",
      "custom_details": "Home to one of the few enchantment gemstone mines outside the Selin Flats. The Pit of Champions uses powerful time magic to allow lethal combat while preventing actual deaths.",
      "primary_inhabitants": "Humans, and elves primarily with a diverse mix of travelers and merchants. the leaders of the tiefling families are commonly seen in the luxury districts and seats in the Pit of Champions.",
      "description": "The capital of Titanrock, Redwater has grown from a humble fishing village into a wealthy, bustling port city. Its skyline is dominated by the grand Pit of Champions arena, where spectators gather to watch the world's most spectacular magical gladiatorial contests.",
      "history": "Originally a small fishing village, Redwater remained relatively untouched during the Phoenix War. The discovery of enchantment gemstones and the construction of the Pit of Champions transformed it into a major economic center and eventually the capital of Titanrock.",
      "culture": "A blend of traditional port city practicality with nouveau riche extravagance, driven by the wealth from the mines and arena. The city has a thriving enchanter's quarter and tourist district.",
      "politics": "Governed by a royal appointee who manages the city's substantial economic interests on behalf of the Crown of Titanrock.",
      "architecture": "A mix of practical port infrastructure, mining facilities, and wealthy newer districts. The Pit of Champions stands as the city's most impressive structure.",
      "relationships": "Strong trade connections throughout the region due to its port network and unique attractions.",
      "points_of_interest": "- The Pit of Champions\n- Enchantment Gemstone Mines\n- Port Network\n- Enchanter's Quarter\n- Sunset View Gardens",
      "image_path": "images/redwater.jpg"
    }
  }
}