{
  "config": {
    "base_path": "docs/locations/cities",
    "template": "_templates/city_template.md"
  },
  "items": {
    "Redwater": {
      "auto_link_strings": [
        "Redwater"
      ],
      "name": "Redwater",
      "type": "City",
      "nation": "Valmere",
      "region": "Crimson Coast",
      "population": "52,000",
      "known_for": "Crimson wine, alchemical exports, underground fighting rings",
      "founding_epoch": "Age of Blood",
      "ruling_power": "House Virell",
      "government_type": "Oligarchic Council",
      "music_path": "Redwater | Bloodborne OST - The Hunter.mp3",
      "song_name": "Bloodborne OST - The Hunter",
      "custom_details": "Said to be built atop a slumbering demigod, Redwater’s foundations thrum with latent energy.",
      "primary_inhabitants": "Humans, Tieflings, a small but powerful circle of Bloodmages",
      "description": "Redwater is a fog-covered port city built along the jagged cliffs of the Crimson Coast. Blood-red rivers split the city into districts, rumored to be tinted by ancient rituals rather than sediment.",
      "history": "Founded during the Age of Blood as a strategic military hold, Redwater became a thriving trade center after the construction of the Blood Gate docks.",
      "culture": "Extravagant, secretive, and indulgent. The citizens of Redwater prize wine, masks, and mystery.",
      "politics": "Controlled by a merchant oligarchy led by House Virell. Political power often shifts through duels, blackmail, or assassination.",
      "architecture": "Twisting streets, steep stairs, and towering gothic spires wrapped in ivy and crimson moss.",
      "relationships": "Tense with the Holy Empire of Dross, allied loosely with the city-state of Caelthas.",
      "points_of_interest": "- The Blood Gate\n- Crimson Archives\n- The Masked Market\n- The Arena of Chains",
      "image_path": "images/redwater.jpg"
    },
    "Caelthas": {
      "auto_link_strings": [
        "Caelthas"
      ],
      "name": "Caelthas",
      "type": "Floating City",
      "nation": "Skyreach Accord",
      "region": "Upper Aether",
      "population": "18,000",
      "known_for": "Aether crystals, flying ships, and arcane academies",
      "founding_epoch": "Era of Ascent",
      "ruling_power": "The Conclave of Eight",
      "government_type": "Magocratic Republic",
      "music_path": "Caelthas | Final Fantasy - Zanarkand Reimagined.mp3",
      "song_name": "Final Fantasy - Zanarkand Reimagined",
      "custom_details": "Gravity is optional in parts of Caelthas. Its streets spiral vertically and sideways depending on the tower’s arcane tuning.",
      "primary_inhabitants": "Elves, Gnomes, Skyborn (aeromancers)",
      "description": "Caelthas drifts among the clouds, anchored by a shard of the fallen moon. It glows faintly blue at night and can be seen from hundreds of miles away.",
      "history": "Formed by a coalition of powerful wizards who broke away from terrestrial politics. Originally intended as an experimental research station.",
      "culture": "Academic, eccentric, and meritocratic. Dueling for scholarly prestige is common.",
      "politics": "The Conclave of Eight is elected based on arcane accomplishments. Each seat governs a specific domain of magic and policy.",
      "architecture": "Glass skybridges, floating domes, and spiraling crystal towers shaped by magic.",
      "relationships": "Mutually beneficial relationship with Redwater. Distrusted by most grounded kingdoms.",
      "points_of_interest": "- The Moonshard Core\n- Aeonspire Academy\n- The Singing Gardens\n- Skywhale Docks",
      "image_path": "images/caelthas.jpg"
    }
  }
}