{
  "config": {
    "base_path": "docs/species",
    "template": "_templates/species_template.md_template"
  },
  "items": {
    "Angel": {
      "auto_link_strings": [
        "Angels",
        "Angel",
        "Angelic"
      ],
      "name": "Angel",
      "type": "Divine",
      "origin": "The Spaces Between Universes",
      "lifespan": "Immortal",
      "average_size_range": "152-1219 cm (5-40 ft)",
      "physique": "Varies widely; often appearing as surreal, a mix of metal and divine energy'",
      "languages": [
        "Angeltongue - A language similar to Celestial, but with a more complex grammar and syntax",
        "All languages (through telepathy)"
      ],
      "homelands": "The Void Between Realms",
      "other_regions": "Occasionally manifest within universes when pursuing multiversal travelers",
      "history": "Angels emerged in the spaces between universes, possibly as a natural defense mechanism of the multiverse itself. Their origins are shrouded in mystery, but they appear to have existed since the earliest days of the multiverse, serving as guardians and enforcers of cosmic boundaries.",
      "religion": "Unknown if they worship any higher power; they may consider themselves servants of the multiverse's natural order",
      "traditions": [
        "Enforcing multiversal boundaries",
        "Returning travelers to their home realms",
        "Eliminating persistent boundary-breakers"
      ],
      "notable_figures": [
        "Archangels (names unknown) - Leaders of the various hiveminds"
      ],
      "relationships": [
        "Hostile toward multiversal travelers",
        "Neutral toward beings that remain in their designated realms",
        "Relationship with gods is complex and largely undocumented"
      ],
      "example_image_paths": [
        "angel_example.jpg",
        "angel_example2.jpg",
        "angel_example4.jpg"
      ],
      "custom_details": "Angels exist in multiple hiveminds, each led by an Archangel who oversees a specialized division. While the exact purposes of these divisions remain mysterious, each appears to serve a distinct cosmic function. Angels manifest in forms that often defy normal physics and biology, appearing surreal and sometimes impossible to comprehend. They share thoughts and knowledge telepathically within their hivemind collective. Though sharing a name with mythological guardians, these beings are more akin to cosmic enforcers, methodically maintaining universal boundaries with unwavering focus.",
      "distribution": "Angels primarily exist in the void between universes, though they can manifest within any realm when pursuing those who have crossed universal boundaries. They seem capable of traversing the multiverse with ease, suggesting an innate understanding of its structure that surpasses most other beings."
    },
    "Aureala": {
      "auto_link_strings": [
        "Aureala",
        "Aurealas"
      ],
      "name": "Aureala",
      "type": "Flora",
      "origin": "A magically-infused tree species endemic to the Aureate",
      "homelands": "The forests of the Aureate",
      "other_regions": "No Aurealas are found outside of the Aureate",
      "average_size_range": "height: roughly 1m when fully grown (sapling); mature trees can reach 20m or more",
      "lifespan": "approximately 6 years for saplings; mature trees can live for centuries as part of the supercolony",
      "example_image_paths": [
        "aureala_example.jpg"
      ],
      "custom_image_width": "700px",
      "custom_details": "Aurealas are a species of enchanted jungle trees known for their lavender-colored bark and rich purple foliage. Native exclusively to the Aureate, they form a vast, interconnected supercolony known by the same name, all Aurealas in The Aureate are actually the giant plant. No Aurealas are permitted to grow outside this region, by the people of the Aureate, as their magic is sacred to the people who live among them. There is some black market trade of Aurealas, but it is strictly forbidden by the people of the Aureate. The people of the Aureate are very protective of their sacred plant and will not tolerate any harm to them unless condoned through ritual. The Aureate people's have hunters who will find and punish those who harm or harvest Aurealas without permission. \n\nThe trees are bioluminescent at night, with leaves that glow faintly with hues ranging from violet to deep indigo. Their bark is infused with potent magical energy, often used in crafting enchanted items such as weapons, armor, and ceremonial jewelry. However, harvesting any part of an Aureala is only permitted through a ritualized exchange—performed by druids or sanctioned mages of the Aureate.\n\nThe inhabitants of the Aureate build their homes high in the trees, using the massive trunks and wide limbs of the Aurealas as foundations for elevated villages. Living on the jungle floor is both culturally taboo and environmentally dangerous, due to magical fauna and unstable terrain.\n\nAurealas thrive only in the hyper-saturated magical ecosystem of the Aureate, which is similar in climate and density to the Amazon rainforest, but with rich violet and lavender coloration dominating the palette. Their flowers bloom in rhythmic pulses in sync with leyline cycles, giving the canopy an otherworldly, shimmering pattern during bloom seasons. Given their Sacred status, the Aureate people don't construct their tree villiages out wood, but rather out of netting, metals, and stone"
    },
    "Basilisk": {
      "auto_link_strings": [
        "Basilisk",
        "Basilisks"
      ],
      "name": "Basilisk",
      "type": "Primordial",
      "origin": "Descendants of the primordial Basilisk Petrifax, who was formed from the divine source itself.",
      "lifespan": "Immortal",
      "average_size_range": "1500-2400 cm (50-80 ft) in length",
      "physique": "Serpentine creatures with a deadly gaze that can petrify living beings by freezing them in time. The process freezes the target in time, making for a few days, and while frozen, the target appears with a silver gleam/glow. The basilisks scales are are iridescent, reflecting light in a spectrum of colors, and their eyes are said to hold the secrets of time itself. They are quite large, and have a long tail with a sharp point at the end. Basilisks are also venoumous, and their venom is deadly to almost all living beings, including themselves. But they rarely use it, preferring to use their time magic to freeze their enemies in time.",
      "languages": [
        "All languages (through telepathy)"
      ],
      "homelands": "The Astral Plane, where they weave through the fabric of time like threads in a tapestry.",
      "other_regions": "Dense forests and underground lairs, often near ley lines where time and space converge.",
      "history": "Basilisks are feared for their time-freezing gaze and are often hunted by adventurers seeking glory. They are known to be crafty and greedy, but generally good-natured unless it involves their possessions. Legends speak of Basilisks who have witnessed the rise and fall of entire civilizations, their memories serving as living chronicles of history.",
      "religion": "Feared and avoided by most cultures, though some sects revere them as avatars of time and change.",
      "traditions": [
        "Solitary ambush hunting, using their time magic to anticipate prey movements.",
        "Guardians of hidden treasures, often hoarding artifacts of great temporal power.",
        "Lovers of gold and deals, known to engage in complex trade agreements with those who dare approach them."
      ],
      "notable_figures": [
        "Petrifax the Eternal - The first Basilisk, said to have woven the first threads of time."
      ],
      "relationships": [
        "Feared by many species due to their lethal abilities.",
        "Known for making deals and contracts, often involving time-bound agreements."
      ],
      "example_image_paths": [
        "basilisk_example.jpg"
      ],
      "custom_details": "Basilisks are solitary and elusive, often residing in caves in the Astral Plane where they can hunt without disturbance. They are powerful in time magic and love making deals and contracts. They are protective of their possessions but are open to trading for items they desire. Their love for gold is legendary, and they are known to craft intricate timepieces from the precious metal.",
      "distribution": "Primarily found in the Astral Plane, with some inhabiting secluded areas of the Material Plane. They are often drawn to places where time flows differently, such as ancient ruins or enchanted forests."
    },
    "Celestial": {
      "auto_link_strings": [
        "Celestial",
        "Celestials"
      ],
      "name": "Celestial",
      "type": "Humanoid",
      "origin": "Transformed Elves, blessed by interdimensional beings known as angels",
      "lifespan": "750-1000 years",
      "physique": "Similar to Elves in basic form, but distinguished by large feathered wings, more dramatically pointed ears, and eyes that emit a soft glow. Their features tend to be more angular than their Elven ancestors.",
      "languages": [
        "Celestial",
        "Sylvaric"
      ],
      "custom_details": "",
      "homelands": "Celestia",
      "other_regions": "",
      "distribution": "",
      "history": "",
      "religion": "",
      "traditions": [
        ""
      ],
      "notable_figures": [],
      "relationships": [
        "Ongoing territorial disputes with Dragonborn",
        "Viewed as arrogant by many species, particularly Dwarves",
        "Maintain diplomatic but distant relations with most other species",
        "Often seen as aloof by mortal races"
      ],
      "example_image_paths": [
        "celestial_example.jpg"
      ],
      "average_size_range": "160-206 cm (5'3\"-6'9\")"
    },
    "Centaur": {
      "auto_link_strings": [
        "Centaur",
        "Centaurs"
      ],
      "name": "Centaur",
      "type": "Astral",
      "origin": "Descendants of the celestial horse and human union, blessed by the stars.",
      "lifespan": "200-300 years",
      "physique": "Half-human, half-horse beings known for their strength and speed. They possess the upper body of a human and the lower body of a horse.",
      "languages": [
        "Sylvaric",
        "Celestial"
      ],
      "homelands": "The Astral Plains",
      "other_regions": "Forests and open fields in the Material Plane",
      "history": "Centaurs are known for their wisdom and connection to the stars. They are often seen as guides and protectors of the natural world.",
      "religion": "Revere the stars and celestial bodies, believing them to be the spirits of their ancestors.",
      "traditions": [
        "Star-gazing ceremonies",
        "Seasonal migrations"
      ],
      "notable_figures": [],
      "relationships": [
        "Respected by many species for their wisdom and strength",
        "Often serve as mediators in conflicts"
      ],
      "example_image_paths": [
        "centaur_example.jpg"
      ],
      "custom_details": "Centaurs are known for their deep connection to nature and the cosmos. They often serve as guardians of ancient forests and sacred sites.",
      "distribution": "Primarily found in the Astral Plains, with some communities in the Material Plane."
    },
    "Demigod": {
      "auto_link_strings": [
        "Demigod",
        "Demigods"
      ],
      "name": "Demigod",
      "type": "Amorphous",
      "origin": "Born from the union of gods and mortals",
      "lifespan": "Immortal",
      "physique": "In their natural form, they appear as black amorphous sludge. Most use control masks (typically white porcelain) to maintain humanoid form, though these aren't required. Their 'clothing' is actually formed from their own substance, usually appearing as black garments with no visible skin.",
      "languages": [
        "Sylvaric"
      ],
      "custom_details": "Completely invulnerable to all forms of damage or harm. While control masks help maintain humanoid form, Demigods can shape their amorphous bodies at will. The white porcelain mask and black clothing appearance is their most common chosen form.",
      "homelands": "",
      "other_regions": "",
      "distribution": "",
      "history": "",
      "religion": "",
      "traditions": [
        ""
      ],
      "notable_figures": [],
      "relationships": [
        "Complex relationships with their divine and mortal parentage",
        "Very often seen with distrust because of their chaotic and unpredictable nature also because of their fondness of alchemy",
        "Frequently seen with the Fey, due to their similar chaotic and unpredictable nature"
      ],
      "example_image_paths": [
        "demigod_example.jpg"
      ],
      "average_size_range": "N/A - amorphous form can take any size though they maintain the same mass of around 100 kg (220 lbs)"
    },
    "Dragon": {
      "auto_link_strings": [
        "Dragon",
        "Dragons"
      ],
      "name": "Dragon",
      "type": "Primordial",
      "origin": "All dragons are descendants of the primordial dragon Fafnir, native to the Astral Plane",
      "lifespan": "Immortal",
      "physique": "Come in several distinct forms: serpentine dragons with four limbs, long bodies and multiple wing sets; stocky four-limbed dragons with two wings; and two-legged variants with prehensile wing-appendages.",
      "languages": [
        "Draconic",
        "All languages (through telepathy)"
      ],
      "custom_details": "Highly intelligent and magical beings who reproduce asexually and do not associate with gender. Like other the slothturtles, they continue growing throughout their immortal lives. Their proud and noble nature has shaped much of their history and interactions with other species.",
      "homelands": "The Astral Plane",
      "other_regions": "no dragons permanently live outside of the astral plane due to self-imposed exile",
      "distribution": "Primarily inhabit the Astral Plane, though historically some groups migrated to the material plane. Those who remained in the mortal realm became tyrannical rulers until their eventual defeat.",
      "history": "Originally all dragons lived in the Astral Plane. Millennia ago, some migrated to the material plane where they established dominion over large territories. The more cruel among them remained to rule over mortals, leading to their eventual disownment by their Astral kin. These terrestrial dragons were ultimately defeated by the sparkbearer Asher, whose revolution ended their reign. The region most affected by dragon rule became Rositoria, named after Asher.",
      "religion": "The dragons are not religious, but they do hold the sparkbearer Asher in high regard - they are also practicers of necromancy and talk with the dead often in religious ceremonies - there are also sections who worship the members of the dragongod pantheon - though they are not worshipped as gods, but as legendary or wise figures",
      "traditions": [
        "Have complex customs regarding territory, hierarchy, and interaction with mortals.",
        "Most traditions stem from preventing the abuse of power that led to the fall of the material plane dragons."
      ],
      "notable_figures": [],
      "relationships": [
        "Share special connection with Dragonborn due to the dragongift blessing",
        "Generally maintain far distance from mortal affairs due to historical conflicts",
        "Respected and often feared by most species",
        "Sometimes serve as neutral mediators in major conflicts",
        "Maintain strict separation between Astral and former material plane dragons",
        "Hold deep respect for the sparkbearer Asher despite his role in ending dragon rule"
      ],
      "culture": "Highly individualistic yet maintain strong traditions. The Astral dragons particularly value nobility and responsible use of power, learned from the cautionary tale of their material plane kin. Violent and aggressive dragons are often ostracized from their kind, and are often hunted by the Astral dragons. The dragons do protect their own kind though, and will come to their defense if harmed. They believe dragons should be judged by their own kind, not by mortals.",
      "example_image_paths": [
        "dragon_example.jpg"
      ],
      "average_size_range": "length: 366-1219 cm (12-40 ft) with extreme outliers. Weight: newborn 1-1.5 kg (2-3 lbs), adult average 1800 kg (2 tons), ancient specimens reaching several dozen tons"
    },
    "Dragonborn": {
      "auto_link_strings": [
        "Dragonborn"
      ],
      "name": "Dragonborn",
      "type": "Humanoid",
      "origin": "Divine Blessing placed by the dragon god Shal'nan on her human followers",
      "lifespan": "80-150 years",
      "physique": "Humanoid with reptilian features including scales, which provide natural magical resilience. Their appearance is a result of the Dragongift blessing.",
      "languages": [
        "Draconic",
        "Sylvaric"
      ],
      "custom_details": "The Dragongift not only transformed their physical appearance but also granted them innate knowledge of dragon magic.",
      "homelands": "Shal'nan (nation)",
      "other_regions": "About half of the Dragonborn population lives outside Shal'nan, scattered across various regions of the world. Very few Dragonborn live in the celestia though, Given the tensions between the two species.",
      "distribution": "Tend to live in small village communities, even outside their homeland",
      "history": "The Dragonborn came into being when the dragon god Shal'nan blessed her human followers with what is now known as the Dragongift.",
      "religion": "Most Dragonborn worship either nature deities or the Dragongods pantheon, particularly Quetzalcoatl and Shal'nan",
      "traditions": [
        "The Journey of Insight - Young Dragonborn (ages 20-25) embark on worldwide travels."
      ],
      "notable_figures": [],
      "relationships": [
        "Generally maintain good relations with most species",
        "Have ongoing territorial disputes with Celestials",
        "Share mutual respect with Dwarves for their respective crafts",
        "Maintain peaceful trade relations with most other nations"
      ],
      "example_image_paths": [
        "dragonborn_example.jpg"
      ],
      "average_size_range": "height: males 188 cm (6'2\"), females 201 cm (6'7\")"
    },
    "Dwarf": {
      "auto_link_strings": [
        "Dwarf",
        "Dwarves",
        "Dwarven"
      ],
      "name": "Dwarf",
      "type": "Humanoid",
      "origin": "Share a common ancestor with Elves, believed to be the second oldest sentient species after Elves",
      "lifespan": "200-400 years",
      "physique": "",
      "languages": [
        "Dwarven",
        "Sylvaric"
      ],
      "custom_details": "Masters of metalwork and maritime trade, Dwarves have established themselves as the premier craftspeople of Sylvarus, particularly in metallurgy and stonework. Their influence on global trade through their powerful merchant fleets is nearly as significant as their mastery of crafting. Have detailed treaties with Halflings regarding lumber harvesting in the Northwest Tundra, including strict sustainability rules requiring two trees planted for each one cut and limits on trees per acre.",
      "homelands": "Kamboramm",
      "other_regions": "Outside of Kamboramm, significant Dwarven populations can be found in Rositoria and Mideer, with smaller communities scattered throughout other nations.",
      "distribution": "While primarily concentrated in Kamboramm, Dwarven craftspeople can be found throughout most nations, typically working as smiths, masons, and other skilled trades. Though capable in all professions, they culturally prefer hands-on work over administrative roles.",
      "history": "The Dwarves built their civilization on the twin pillars of craftsmanship and seafaring, developing into one of the most economically influential species through their control of maritime trade routes and high-quality metalwork production.",
      "culture": "Dwarven culture emphasizes durability and permanence, reflected in their stone architecture and metalwork. Despite their reputation for stoic craftsmanship, they are known for their warm hospitality and becoming particularly friendly when drinking.",
      "traditions": [
        "Lunar calendar celebrations throughout the year.",
        "Historical anniversary commemorations.",
        "Extensive drinking festivals.",
        "Crafting competitions and exhibitions.",
        "Maritime trade festivals."
      ],
      "architecture": "Dwarven cities are masterworks of stone architecture, with minimal use of wood except in their impressive naval fleets. Their settlements are known for their durability and impressive engineering.",
      "religion": "Generally secular in outlook, viewing gods more as powerful wizards than divine beings. While they honor their ancestors and celebrate legendary craftspeople and heroes, they typically don't worship them. Their respect for achievement and mastery tends to be practical rather than religious in nature.",
      "notable_figures": [],
      "relationships": [
        "Historical tensions with Elves over resource disputes and cultural differences",
        "View Humans as capable but naive, willing to work together but rarely under human leadership",
        "Consider Celestials to be even more arrogant than Elves",
        "Hold deep respect for Halfling magic and peaceful, sustainable, and self-sufficient ways",
        "Admire Dragonborn courage and martial prowess",
        "Particularly respect Orcish craftsmanship",
        "Maintain strong suspicion of Fey and Fairies",
        "Protect Halfling territories in exchange for regulated lumber access"
      ],
      "example_image_paths": [
        "dwarf_example.jpg"
      ],
      "average_size_range": "107-137 cm (3'6\"-4'6\")"
    },
    "Elf": {
      "auto_link_strings": [
        "Elf",
        "Elves",
        "Elvish"
      ],
      "name": "Elf",
      "type": "Humanoid",
      "origin": "Evolutionary Digergence",
      "lifespan": "750-1000 years",
      "physique": "Usually more slender than humans, agile, with pointed ears and sharp facial features. Skin tones range from pale silver to deep forest green, to charcoal black depending on subrace.",
      "languages": [
        "Elvish",
        "Sylvaric"
      ],
      "custom_details": "",
      "homelands": "Taliander",
      "other_regions": "Widely spread across Sylvarus, second only to humans - usually stays on the western continent",
      "distribution": "",
      "history": "Elves are believed to be among the first sentient species to walk the surface of Sylvarus. Their history claims they were shaped from song and moonlight by a forgotten celestial being. Their early history is closely tied to the Feywild.",
      "religion": "Primarily worship deities of nature, stars, and the arcane.",
      "traditions": [
        "Seasonal festivals.",
        "Moon rites.",
        "Coming-of-age quests."
      ],
      "notable_figures": [],
      "relationships": [
        "Tense history with Dwarves due to resource disputes and cultural clashes",
        "Relatively peaceful relations with Humans",
        "Ongoing conflict with Dwarves stems from fundamentally different approaches to nature and resources"
      ],
      "example_image_paths": [
        "elf_example.jpg"
      ],
      "average_size_range": "160-206 cm (5'3\"-6'9\")"
    },
    "Fairy": {
      "auto_link_strings": [
        "Fairy",
        "Fairies"
      ],
      "name": "Fairy",
      "type": "Humanoid",
      "origin": "Hybrid offspring of Fey and mortals",
      "lifespan": "Immortal",
      "physique": "Small in stature, combining traits of their mortal parent with Fey characteristics - notably thin builds, slightly pointed ears, and dark blood that appears almost black. Their appearance varies widely based on their mortal parentage, with skin tones ranging from pale blue to deep purple. Many have subtle luminescence that becomes more pronounced in darkness or when experiencing strong emotions.",
      "languages": [
        "Feyspeak",
        "Sylvaric"
      ],
      "custom_details": "Possess an innate connection to chaos magic, allowing them limited influence over probability and natural elements. This connection is inherited from their Fey parent but is typically less potent than pure Fey abilities. Many Fairies develop specialized talents based on their lineage and personal affinities - some excel at plant growth, others at weather manipulation, and some at emotional influence. Unlike their Fey parents, Fairies retain clear memories throughout their immortal lives and often serve as historians and storytellers. Their wings, which typically manifest during adolescence, vary greatly in appearance from butterfly-like to dragonfly patterns, and can be retracted when not in use.",
      "homelands": "The Feywilds",
      "other_regions": "Small communities can be found in most forested regions of Sylvarus, particularly in ancient groves and areas with strong magical resonance. Notable settlements exist in the forests of Taliander and some of the northern valleys of Shal'nan.",
      "distribution": "Most Fairies congregate in the central city of the Feywilds, where the chaos beasts are less prevalent. This creates a vibrant community mixing Fey and Fairy culture. Those living in the mortal realm tend to establish small, hidden communities in ancient forests or near ley line intersections. They often serve as guardians of these magical locations, maintaining the balance between the natural and supernatural worlds.",
      "history": "Fairies emerged as a species through the union of Fey with various mortal races. Their existence bridges the gap between the chaotic nature of the Feywilds and the ordered world of mortals.",
      "religion": "Varied, often influenced by their mortal parent's culture, though many maintain a deep spiritual connection to the chaotic forces of the Feywilds. Rather than worshipping specific deities, many Fairies practice a form of animism, honoring the spirits of nature and the fundamental forces of chaos and order. Many observe seasonal rituals tied to natural cycles, with particular emphasis on solstices and equinoxes in the mortal realm.",
      "traditions": [
        "Have a strong affinity for celebration, gambling, and artistic pursuits.",
        "Fairy celebrations are renowned for their elaborate decorations, enchanted music, and food that changes flavor with each bite.",
        "Mark significant life events with gift exchanges.",
        "Many Fairies undertake a 'Grand Wandering' in their youth."
      ],
      "notable_figures": [],
      "relationships": [
        "Find Dwarven distrust amusing but generally respect their wishes to be left alone",
        "Most Fairies avoid Dwarven settlements out of courtesy",
        "Some are known to be quite intentionally mischievous towards dwarves",
        "Share close bonds with Fey communities",
        "Generally welcomed in most mortal settlements due to their magical abilities",
        "Maintain particularly close relationships with Elves, who often seek their guidance in matters of ancient magic",
        "Serve as advisors to many species, on the matters of the feywilds and the fey",
        "Often form mutually beneficial arrangements with Orcs, exchanging magical knowledge artifacts for information about technology and gold",
        "Regarded with cautious respect by Humans, who value their magical talents but remain wary of their chaotic nature"
      ],
      "culture": "Share the Fey's love for vibrant clothing, unique fashion, and elaborate hats. Music plays a central role in their society, and they often blend mortal musical traditions with Fey influences. Fairy society values creativity, spontaneity, and individual expression above all else. They organize themselves in loose collectives rather than rigid hierarchies, with leadership roles shifting based on specific needs and talents. Their homes are often architectural marvels that blend seamlessly with natural surroundings, incorporating living plants and magical enhancements. Fairy markets are famous throughout the realms for offering rare magical items, enchanted crafts, and experiences that cannot be found elsewhere. Despite their chaotic nature, Fairies maintain a strong ethical code regarding their interactions with mortals, believing that their magic should bring wonder and beauty rather than harm.",
      "example_image_paths": [
        "fairy_example.jpg"
      ],
      "average_size_range": "91-107 cm (3'0\"-3'6\")"
    },
    "Fey": {
      "auto_link_strings": [
        "Fey"
      ],
      "name": "Fey",
      "type": "Amorphous",
      "origin": "Transformed mortal souls from before the creation of the Underworld",
      "lifespan": "Immortal",
      "physique": "Extremely varied in form, but universally characterized by very dark grey, almost black flesh and unnaturally thin bodies. They also all exclusively have eyes which glow a dim white constantly. Forms range from nearly humanoid to wildly alien, featuring multiple limbs, tentacles, or other unusual appendages.",
      "languages": [
        "Feyspeak",
        "Sylvaric"
      ],
      "custom_details": "Possess an innate connection to chaos magic, allowing them to manipulate probability and reality itself to varying degrees. This connection makes them unpredictable and sometimes dangerous to interact with. Some of the more powerful Fey can use chaos magic to perceive multiple potential futures simultaneously. Though all have reflexes of such and sometimes respond to events that haven't yet occurred or react supernaturally quickly. Their memories are still that of the mortals they once were, but their vast lifespans mean most dont remember their mortal lives or the majority of their pasts. Fairies, their offspring, are valued as historians -. Fey bodies are partially composed of raw chaos energy, allowing some to reshape themselves at will, though most maintain a consistent form for convenience when interacting with other species.",
      "homelands": "The Feywilds",
      "other_regions": "Rarely found outside the Feywilds except during specific celestial alignments or at ancient sites where the boundary between realms is thin. Some Fey maintain permanent residences at these boundary locations, serving as guardians or gatekeepers.",
      "distribution": "Primarily confined to the Feywilds, though occasionally venture into the mortal realm for brief periods. Within the Feywilds, they tend to cluster in regions that resonate with their particular affinity for certain aspects of chaos. Some are drawn to areas of wild growth and natural abundance, while others prefer zones of constant change and transformation. The most powerful Fey often claim territories in the far reaches of the Feywilds, where chaos energy is more concentrated.",
      "history": "The Fey came into existence when mortal souls, untethered after death in an era before the Underworld's creation, were transformed by exposure to raw chaos energy. This transformation granted them immortality.",
      "religion": "Do not worship gods in the conventional sense, though they acknowledge and sometimes interact with divine beings. Instead of religion, many Fey practice a form of reverence toward the fundamental forces of chaos itself. They recognize patterns within randomness and find meaning in the ever-changing nature of existence. Some elder Fey are themselves worshipped as minor deities by certain mortal cults, though they rarely encourage such behavior directly.",
      "traditions": [
        "Highly individualistic with few shared customs beyond a love for games of chance, bargains, and celebrations.",
        "The Carnival of Possibilities is a gathering that occurs at unpredictable intervals.",
        "Creation of 'chaos gardens' - spaces where multiple potential realities overlap.",
        "Practice 'name-keeping' - the careful guarding of their true names."
      ],
      "notable_figures": [],
      "relationships": [
        "Viewed with extreme caution by most mortal species",
        "Maintain complex relationships with Fairies, their offspring with mortals",
        "Often enter into bargains with mortals seeking power or knowledge",
        "Generally avoid direct conflict with gods and other powerful entities",
        "Share a mutual fascination with Demigods, whose amorphous nature resonates with their own",
        "Maintain an ancient pact with Dragons that limits their direct interference in mortal affairs",
        "View Tieflings with particular interest due to their capacity to channel chaos magic",
        "Regarded with deep suspicion and fear by Dwarves, who find their unpredictable nature antithetical to dwarven values of stability and craftsmanship",
        "Often form temporary alliances with Elves for purposes that remain obscure to mortal understanding"
      ],
      "culture": "Fey society defies conventional understanding, operating on principles that seem contradictory or impossible to outside observers. Status among Fey is determined by a complex interplay of age, power, and the uniqueness of one's experiences. They organize themselves into 'courts' that are not geographic or political entities but rather philosophical alignments based on their relationship to different aspects of chaos. These courts are fluid, with Fey moving between them as their nature evolves. Art is central to Fey existence, though their creations often incorporate elements that change or transform the viewer in subtle ways. Music, in particular, holds special significance, with Fey compositions containing harmonies that mortals find extremely catchy and often cathartic. Some of the more advanced composers can create music that, somehow  realm that can alter the fabric of reality when performed correctly. Despite their chaotic nature, Fey adhere strictly to the terms of agreements they make, though they are notorious for exploiting loopholes and unexpected interpretations.",
      "example_image_paths": [
        "fey_example1.jpg",
        "fey_example2.jpg"
      ],
      "average_size_range": "91-213 cm (3'0\"-7'0\"), but variations extend well beyond this range"
    },
    "Griffin": {
      "auto_link_strings": [
        "Griffin",
        "Griffins"
      ],
      "name": "Griffin",
      "type": "Primordial",
      "origin": "Descendants of the primordial Griffin Aquileo",
      "lifespan": "Immortal",
      "average_size_range": "244 cm (8 ft) to shoulder height, 488-732 cm (16-24 ft) wingspan",
      "physique": "Creatures with the body of a lion and the head and wings of an eagle. Known for their powerful build and fierce appearance.",
      "languages": [
        "All languages (through telepathy)"
      ],
      "homelands": "The Astral Plane",
      "other_regions": "Forests and mountainous regions",
      "history": "Griffins are known for their strength and majesty, often depicted as noble guardians in mythology. Throughout history, they have been sought after as allies by various civilizations, though their proud nature means they choose their associations carefully.",
      "religion": "Associated with deities of protection and valor",
      "traditions": [
        "Territorial guardianship",
        "Protectors of sacred sites",
        "Living in small groups of around 10 individuals",
        "Periods of solitary wandering before returning to the group",
        "Trading combat services for specially crafted armor"
      ],
      "notable_figures": [],
      "relationships": [
        "Respected by many cultures for their noble nature",
        "Quick to anger when insulted or challenged",
        "Form strong bonds with those who earn their trust",
        "Known to engage in trade with skilled armorers"
      ],
      "example_image_paths": [
        "griffin_example.jpg"
      ],
      "custom_details": "Griffins are proud and temperamental creatures, quick to respond to perceived insults or challenges to their honor. They live in small groups of roughly ten individuals, though it's common for members to spend extended periods alone before returning to their group. Despite their innate magical abilities, they are known to trade their martial prowess and magical services in exchange for mortal-crafted armor, which they wear with pride. Their fierce nature and combat abilities make them formidable warriors, respected and sometimes feared by other species.",
      "distribution": "Commonly found in the Astral Plane, with some residing in remote areas of the Material Plane. Groups typically claim large territories which they defend vigorously."
    },
    "Halfling": {
      "auto_link_strings": [
        "Halfling",
        "Halflings"
      ],
      "name": "Halfling",
      "type": "Humanoid",
      "origin": "Descended from humans in ancient times",
      "lifespan": "180-200 years",
      "physique": "Hardy constitution despite their small size, with resistance to cold weather. Unlike their human ancestors, they have proportionally larger hands and feet, but retain rounded ears.",
      "languages": [
        "Sylvaric"
      ],
      "custom_details": "Possess a natural affinity for magic and are known for their exceptional cooking abilities. Their underground homes are marvels of engineering, combining comfort with protection from the harsh tundra climate. Skilled at adapting to their harsh environment, particularly notable in their persistent attempts to grow tropical spices in cold climates. Their primary import is exotic spices, though they've had varying success in cultivating their own. When forced to defend themselves, they rely on their natural magical aptitude and skill with quarterstaffs. Obtain most of their metal goods and jewelry through lumber trade with the Dwarves. Practice strict veganism, avoiding all products that require animal death, though they do consume eggs from quail and chickens, and goat milk.",
      "homelands": "Northwest Tundra",
      "other_regions": "",
      "distribution": "Live primarily in small, interconnected underground towns across the tundra region. Their settlements are connected by elaborate tunnel networks.",
      "history": "",
      "culture": "Value comfort, good food, and peaceful living. Their society revolves around communal gatherings and celebrations, with cooking and crafting being central to their way of life. Their vegan lifestyle extends to avoiding leather, furs, and other animal products that require killing.",
      "traditions": [
        "Host elaborate multi-day celebrations for weddings, births, and funerals.",
        "Mark the equinoxes and solstices with grand feasts and drinking celebrations.",
        "Known for their ability to turn any gathering into a feast."
      ],
      "notable_figures": [],
      "relationships": [
        "Universally respected by other species for their peaceful way of life",
        "Remote location and non-confrontational nature has helped avoid most conflicts",
        "Have a particularly strong relationship with the Dwarves through lumber trade",
        "Receive military protection from Dwarves in exchange for regulated lumber access",
        "Known for fair and honest dealings in all trade relationships"
      ],
      "example_image_paths": [
        "halfling_example1.jpg"
      ],
      "average_size_range": "height: 100-150 cm (3.3-4.9 ft)"
    },
    "Human": {
      "auto_link_strings": [
        "Human",
        "Humans",
        "Humanity"
      ],
      "name": "Human",
      "type": "Humanoid",
      "origin": "Evolutionary Divergence, more closely related to Dwarves than Elves",
      "lifespan": "80-150 years",
      "physique": "A mix of Dwarven and Elvish physiques, stockier than elves but less than dwarves. Known for their circled ears and running endurance. Skin tones have a relatively small range, from light pinkish to dark brown depending on the subrace",
      "languages": [
        "Sylvaric"
      ],
      "custom_details": "",
      "homelands": "Noridge and New Noridge - the only two nations founded and ruled primarily by humans. New Noridge was originally a colony of Noridge that fought for and won its independence many generations ago.",
      "other_regions": "The most widespread species - you can find humans in every nation and territory outside of Athenia. While humans make up significant populations in nations like Tyro, Mideer and Eton, these were not founded by humans alone - Eton was established primarily by elves, while the others were founded by mixed coalitions of different species.",
      "distribution": "",
      "history": "Humans are believed to be a descendant species of the elves, the reason for their short life-spans is unknown, a long time legend is that they were blessed by an ancient god to give them a sense of urgency and importance around time",
      "religion": "Primarily worships the olypmians",
      "traditions": [
        "Bartering is deeply ingrained in human culture, with marketplaces and trade fairs being major social events.",
        "Winter festivals are elaborate multi-day celebrations featuring feasts, music, dancing and gift exchanges.",
        "Gift giving is a core tradition, with presents exchanged not just on special occasions but as a way to strengthen social bonds.",
        "Naming ceremonies for newborns are community celebrations where the child receives blessings and symbolic gifts from family and neighbors.",
        "Harvest festivals in autumn feature competitions in farming, crafting and cooking, with winners earning prestige in their communities.",
        "The Night of Spirits, known as 'Ghosttide', occurs during the autumn equinox when the veil between worlds is believed to be thinnest.",
        "Coming of age ceremonies vary by region but typically occur around age 16, involving tests of skill and wisdom before the young person is considered an adult."
      ],
      "notable_figures": [],
      "relationships": [
        "Tense history with Orcs due to human subjugation of Orcs during the Age of Unity",
        "Most conflicts occur between human nations rather than with other species",
        "Generally more diplomatic with other species than with their own kind",
        "Maintain peaceful trade relations with most races"
      ],
      "example_image_paths": [
        "human_example.jpg"
      ],
      "average_size_range": "height: 152-198 cm (5'0\"-6'6\")"
    },
    "Kraken": {
      "auto_link_strings": [
        "Kraken",
        "Krakens"
      ],
      "name": "Kraken",
      "type": "Primordial",
      "origin": "Descendants of the primordial Kraken Cetuvia",
      "lifespan": "Immortal",
      "average_size_range": "100ft to 1000ft (30m to 305m) in length",
      "physique": "Massive sea creatures with tentacles. Sustained purely by magic, requiring no physical sustenance. Their bodies are capable of channeling immense amounts of sound and water magic.",
      "languages": [
        "All languages (through telepathy)",
        "Sonic vibrations that can carry messages across vast distances"
      ],
      "homelands": "The Astral Plane",
      "other_regions": "Deep ocean trenches and vast seas",
      "history": "Despite fearsome legends, Krakens are peaceful and contemplative beings. Historical accounts of attacks are largely exaggerations of chance encounters. They spend most of their time in deep meditation, moving and acting with deliberate slowness.",
      "religion": "Practice deep meditation and introspection",
      "traditions": [
        "Solitary contemplation",
        "Minimal interaction with other species unless necessary",
        "Using sonic vibrations for long-distance communication between their kind"
      ],
      "notable_figures": [],
      "relationships": [
        "Generally avoid contact with other species",
        "Will defend themselves with devastating force if attacked",
        "Sometimes sought out by those seeking ancient wisdom, though few have the patience for their slow communication style"
      ],
      "example_image_paths": [
        "kraken_example.jpg"
      ],
      "custom_details": "Krakens are deeply introverted beings who rarely communicate even telepathically unless absolutely necessary. They possess devastating magical abilities - their vocalizations alone can kill nearby creatures, and they can control water to create massive floods. Despite this power, they are peaceful unless provoked. They reproduce asexually, with severed tentacles occasionally growing into new Krakens. They subsist entirely on magical energy, spending most of their time in meditative rest. Their wisdom is legendary, though few have the patience to wait for their carefully considered responses.",
      "distribution": "Primarily inhabit the Astral Plane, with rare individuals in the deepest oceans of the Material Plane where they can remain undisturbed in contemplation."
    },
    "Mer": {
      "auto_link_strings": [
        "Mer",
        "Mers"
      ],
      "name": "Mer",
      "type": "Astral",
      "origin": "Descendants of the primordial sea spirits, guardians of the ocean's mysteries.",
      "lifespan": "300-500 years",
      "physique": "Aquatic beings with the upper body of a human and the lower body of a fish. Known for their beauty and grace.",
      "languages": [
        "Aquan",
        "Sylvaric"
      ],
      "homelands": "The Astral Seas",
      "other_regions": "Oceans and seas in the Material Plane",
      "history": "Mers are known for their enchanting songs and deep connection to the ocean. They are often seen as protectors of marine life and the ocean's secrets.",
      "religion": "Worship the sea and its deities, believing them to be the source of all life.",
      "traditions": [
        "Oceanic rituals",
        "Tide celebrations"
      ],
      "notable_figures": [],
      "relationships": [
        "Respected by many for their wisdom and beauty",
        "Often serve as guardians of the ocean's treasures"
      ],
      "example_image_paths": [
        "mer_example.jpg"
      ],
      "custom_details": "Mers are known for their enchanting voices and ability to communicate with marine creatures. They often guide lost sailors to safety.",
      "distribution": "Primarily found in the Astral Seas, with some communities in the Material Plane."
    },
    "Narn": {
      "auto_link_strings": [
        "Narn",
        "Narns"
      ],
      "name": "Narn",
      "type": "Humanoid",
      "origin": "Native to southern Sylvarus",
      "lifespan": "1100-1400 years",
      "physique": "Giants with immense physical strength and durability. Significantly larger than most other humanoid species.",
      "languages": [
        "Narnish",
        "Sylvaric"
      ],
      "custom_details": "Practitioners of a unique form of magic that binds the soul to the bloodstream, igniting divine energy within the body. This Narn magic is sacred, dangerous, and rarely taught to outsiders. Adult Narns are immune to most poisons and illnesses, though their children remain susceptible. Like all sentient beings, Narns can be chosen as Sparkbearers - individuals with divine sparks destined for godhood if they complete their unique trials.",
      "homelands": "Narnlund",
      "other_regions": "No major concentrations outside of Narnlund",
      "distribution": "Primarily concentrated in their homeland, with few venturing far from their territories",
      "history": "The Narns have a long history of honorable kingship and adherence to strict codes of conduct. Their society has remained relatively stable due to their emphasis on wisdom in leadership.",
      "religion": "While they acknowledge the gods, their primary spiritual focus is on living and dying with honor. Sparkbearers among them are treated with respect but not worshipped.",
      "traditions": [
        "Open challenges to leadership through honorable combat.",
        "Emphasis on honorable life and death permeates all aspects of their culture."
      ],
      "notable_figures": [],
      "relationships": [
        "Closest alliance with Humans, with whom they share mutual respect",
        "Hold fierce respect for Dragonborn warriors and their martial prowess",
        "Generally cold and distant toward most other species",
        "Value honor and strength in their interactions with all races"
      ],
      "example_image_paths": [
        "narn_example.jpg"
      ],
      "average_size_range": "height: 300-400 cm (9'10\"-13'1\")"
    },
    "Narntree": {
      "auto_link_strings": [
        "Narntree",
        "Narntrees"
      ],
      "name": "Narntree",
      "type": "Flora",
      "origin": "Legend says they are the result of the magical actions of a forgotten god",
      "homelands": "The mountains of Narnlund",
      "average_size_range": "height: 100-200m (328-656ft), width: 10-20m (32.8-65.6ft)",
      "lifespan": "Unknown - Likely Immortal",
      "example_image_paths": [
        "narntree_example.jpg"
      ],
      "custom_details": "Narntrees are known for their immense size and their ability to grow in the mountains of Narnlund. They grow very slowly and do not stop growing until they die. They favor the rocky, mountainous regions of Narnlund and are known to grow elsewhere but not as well. They are massive in both height and width, with a single trunk that can be up to 30m (100ft) in diameter. Their bark and leaves are light gray like the skin of the Narn, which is where they get their name. Narntrees are incredibly physically resilient, being resistant to both physical and magical damage. Their skin is akin to stone, and even fire is not a threat to them. Legends of them say they are the result of a magical event by a forgotten god. Only one narntree is known to have been felled, it was done so by Anuke, who is now known as the god of determination for her incredible willpower shown in the face of the tree's immense size and resiliance"
    },
    "Orc": {
      "auto_link_strings": [
        "Orc",
        "Orcish",
        "Orcs"
      ],
      "name": "Orc",
      "type": "Humanoid",
      "origin": "Evolutionary Divergence from a common ancestor with Elves, more closely related to Elves than to Dwarves",
      "lifespan": "80-150 years",
      "physique": "Similar build to elves but significantly more muscular. Known for their green-grey skin and tusks that protrude from their lower jaw.",
      "languages": [
        "Sylvaric",
        "Orcish"
      ],
      "custom_details": "",
      "homelands": "Athenia",
      "other_regions": "The overwhelming majority of Sylvarus' Orcs live in Athenia - Though you can find wanderers, diplomats, and explorers here and there in every nation and region of Sylvarus. Most are temporary residents and will return to Athenia. The most common Orcs you will find outside of their homeland are hunters. They search for magical artifacts on the dime of the Athenian government and take them back home.",
      "distribution": "",
      "history": "Humans are believed to be a decendant species of the elves, the reason for their short life-spans is unknown, a long time legend is that they were blessed by an ancient god to give them a sense of urgency and importance around time",
      "religion": "Primarily worships the the Divine Parents, Iranara and Orakothros",
      "traditions": [
        "Homecoming - The Orcish homecoming is a tradition where Orcs who are outside of their hometown return to give birth and stay there for 4 years."
      ],
      "notable_figures": [],
      "relationships": [
        "Historical tension with Humans due to subjugation during the Age of Unity",
        "Generally peaceful but guarded in their dealings with other species",
        "Known to respond with overwhelming force if attacked",
        "Prefer to stay out of others' conflicts"
      ],
      "example_image_paths": [
        "orc_example.jpg"
      ],
      "average_size_range": "height: 188 cm (6'2\") with no sexual dimorphism"
    },
    "Pegasus": {
      "auto_link_strings": [
        "Pegasus",
        "Pegasi"
      ],
      "name": "Pegasus",
      "type": "Primordial",
      "origin": "Descendants of the primordial Pegasus Craxly",
      "lifespan": "Immortal",
      "average_size_range": "183-305 cm (6-10 ft) at the shoulder, 762-914 cm (25-30 ft) wingspan",
      "physique": "Majestic winged horses with powerful, muscular bodies covered in tough, leathery skin. Distinguished by their large bat-like wings and a single spiraling horn protruding from their forehead that serves both as a weapon and tool for channeling their innate magic.",
      "languages": [
        "All languages (through telepathy)"
      ],
      "homelands": "the forest of the astral plane",
      "other_regions": "Found in high-altitude regions and ancient forests in the astral plane, and some are found in the material plane, particularly in the northwest tundra and the mountains of shalnan where they have taken up the role of forest guardians",
      "history": "Pegasi are renowned for their strength, resilience, and deep connection to nature. While they occasionally served as mounts for legendary heroes and gods in ancient mythology, modern Pegasi are more commonly known as fierce protectors of natural spaces.",
      "religion": "Revere the forests and natural world with an almost religious devotion. They consider themselves guardians of nature's balance and will aggressively defend wooded areas from exploitation.",
      "traditions": [
        "Guardians of celestial paths",
        "Forest protection rituals"
      ],
      "notable_figures": [],
      "relationships": [
        "Share a particularly strong bond with Dragonborn, often collaborating on forest protection",
        "Maintain friendly relations with Halflings, appreciating their respect for nature",
        "Harbor deep resentment toward Dwarves due to their historical deforestation practices",
        "Played a crucial role in establishing sustainable forestry practices in the Northwest Tundra",
        "Highly regarded by many cultures as symbols of justice and environmental stewardship"
      ],
      "example_image_paths": [
        "pegasus_example.jpg"
      ],
      "custom_details": "Individual Pegasi are known to claim and protect specific forests from exploitation, leading to the creation of numerous natural sanctuaries across Sylvarus and the astral plane (though this is not as common as in the material plane). These protected areas have evolved into popular parks where people can experience and appreciate nature in its pristine state. Their influence was particularly notable in the Northwest Tundra, where they worked to establish sustainable lumber harvesting rules that are still followed today. While generally peaceful, they can become extremely territorial and aggressive if their protected lands are threatened. Their strong sense of justice extends beyond environmental concerns - they have been known to intervene in cases of significant injustice, though they prefer to focus on protecting natural spaces.",
      "distribution": "While their primary population resides the astral plane, individual Pegasi can be found wherever there are forests in need of protection, including the material plane. They maintain a particularly strong presence in the Northwest Tundra and shalnan, where they oversee sustainable forestry practices"
    },
    "Phoenix": {
      "auto_link_strings": [
        "Phoenix",
        "Phoenixes"
      ],
      "name": "Phoenix",
      "type": "Primordial",
      "origin": "Descendants of the primordial Phoenix Avianna",
      "lifespan": "Immortal",
      "average_size_range": "height: 183-244 cm (6-8ft), wingspan: 488-732 cm (16-24ft)",
      "physique": "Majestic birds with fiery plumage that glows with an inner light. Their feathers range from deep crimson to brilliant gold, with an ethereal flame that dances across their form without burning. When threatened or using their powers, their entire body can become wreathed in intense magical fire.",
      "languages": [
        "Phoenixsong - A melodic language of trills and calls that they can physically vocalize",
        "All languages (through telepathy)"
      ],
      "homelands": "The Astral Plane",
      "other_regions": "Occasionally found in remote, magical locations on the Material Plane, particularly areas with strong healing energies",
      "history": "Phoenixes are legendary creatures known for their cycle of death and rebirth. They are revered in many cultures as symbols of renewal and immortality. Their population has always been small, with current numbers only in the low hundreds. They reproduce asexually, with females laying eggs without the need for males, making them an entirely female species.",
      "religion": "Often associated with deities of fire, rebirth, and healing",
      "traditions": [
        "Passing down ancient healing knowledge through generations",
        "Teaching the art of controlled fire manipulation to their young",
        "Serving as healers and advisors to those who seek their wisdom",
        "Maintaining sacred sites of healing and renewal"
      ],
      "notable_figures": [],
      "relationships": [
        "Highly respected by all species for their wisdom and healing abilities",
        "Often sought out by those in need of powerful healing magic",
        "Maintain peaceful relations with most species, though rarely form close bonds",
        "Particularly revered by those who have witnessed their healing powers"
      ],
      "example_image_paths": [
        "phoenix_example.jpg"
      ],
      "custom_details": "Phoenixes possess extraordinary healing abilities and are considered among the wisest of all beings. While typically peaceful, they are fierce fighters when necessary, demonstrating masterful control over fire magic which they only use in self-defense or to protect others. Upon death, they burst into intense magical flames and are reborn from their own ashes, emerging fully grown with all their memories intact. Their healing powers are legendary, capable of curing ailments that resist other forms of magical healing. They are highly intelligent and thoughtful creatures, often serving as advisors to those who seek their counsel.",
      "distribution": "Primarily found in the Astral Plane, with rare appearances in the Material Plane. Their small population of only a few hundred individuals means encounters with them are extremely rare and often considered significant events."
    },
    "Quall": {
      "auto_link_strings": [
        "Quall"
      ],
      "name": "Quall",
      "type": "Humanoid",
      "origin": "",
      "lifespan": "80-150 years",
      "physique": "",
      "languages": [
        "Quallish"
      ],
      "custom_details": "",
      "homelands": "Parallel Sylvarus",
      "other_regions": "None known",
      "distribution": "They live in a parallel version of Sylvarus, which exists in a parallel universe",
      "history": "They are the only sentient species in their world",
      "religion": "The power of the quall gods is immense due to the quall devotion to them, quallish gods historically have established cults and theocracies, and also known to kill sparkbearers. This is done to avoid competition from any new gods",
      "traditions": [
        "Full devotion to the quall gods influences their culture and traditions, including religious ceremonies, traditions, and holidays."
      ],
      "notable_figures": [],
      "relationships": [
        "No major relationships with other species as they are the only sentient species in their world",
        "Only really known due to the experience of multiversal travelers - especialy the Quall God Delinette, who ascending in Sylvarus after he travels"
      ],
      "example_image_paths": [
        "quall_example.jpg"
      ],
      "average_size_range": "height: 152 cm (5'0\") with no sexual dimorphism"
    },
    "Roc": {
      "auto_link_strings": [
        "Roc",
        "Rocs"
      ],
      "name": "Roc",
      "type": "Primordial",
      "origin": "Descendants of the primordial Roc Aetheria",
      "lifespan": "Immortal",
      "average_size_range": "height: 305-457 cm (10-15 ft) when standing, wingspan: 610-1524 cm (20-50 ft)",
      "physique": "Enormous birds of prey with immense strength and glowing white eyes that brighten with power use. Despite their massive size, they remain graceful flyers through their potent telekinetic abilities. Their keen eyesight is legendary, with some claiming they can see through solid stone.",
      "languages": [
        "All languages (through telepathy)",
        "Limited vocal sounds"
      ],
      "homelands": "The Astral Plane",
      "other_regions": "Coastal regions and oceanic mountain ranges where fish are plentiful",
      "history": "Rocs are legendary for their size, power, and intelligence. While primarily solitary, historical records tell of several instances where Rocs served as advisors to mortal rulers, exchanging their wisdom for food and access to libraries. Their incredible problem-solving abilities have made them valuable, if difficult to recruit, allies.",
      "religion": "Show little interest in religious matters, focusing instead on intellectual pursuits",
      "traditions": [
        "Long-distance fishing expeditions spanning thousands of miles",
        "Collecting and studying books and scrolls",
        "Maintaining complex mental maps of their territories",
        "Testing potential allies with increasingly difficult challenges"
      ],
      "notable_figures": [],
      "relationships": [
        "Generally self-interested and unlikely to aid others without clear benefit",
        "Form lasting bonds with those who earn their respect",
        "Known to honor debts with unwavering loyalty",
        "Occasionally serve as advisors to powerful mortals in exchange for resources, mostly in the form of access to libraries and knowledge",
        "Maintain complex relationships with coastal communities, sometimes trading protection for regular tribute",
        "no specific relations with other species"
      ],
      "example_image_paths": [
        "roc_example.jpg"
      ],
      "custom_details": "Rocs are primarily piscivorous, specializing in hunting large ocean fish. Their incredible stamina allows them to fly for thousands of miles without rest, aided by their telekinetic abilities which help offset their massive size. While physically incapable of complex vocalization, they communicate effectively through a combination of telepathy and telekinesis, often using their mental powers to manipulate objects as a form of expression. Their intelligence manifests particularly in problem-solving scenarios, though they typically apply this ability solely to matters of personal interest unless properly motivated.",
      "distribution": "Primarily inhabit the Astral Plane, with significant populations near oceanic mountain ranges and coastal regions where fish are abundant. They establish vast territories that can span hundreds of miles, which they patrol regularly during their hunting flights."
    },
    "Satyr": {
      "auto_link_strings": [
        "Satyr",
        "Satyrs"
      ],
      "name": "Satyr",
      "type": "Astral",
      "origin": "Born from the union of fey and celestial beings, embodying the spirit of nature.",
      "lifespan": "150-200 years",
      "physique": "Humanoid with goat-like features, including horns and hooves. Known for their agility and musical talents.",
      "languages": [
        "Feyspeak",
        "Sylvaric"
      ],
      "homelands": "The Astral Forests",
      "other_regions": "Woodlands and groves in the Material Plane",
      "history": "Satyrs are known for their love of music and revelry. They are often seen as the life of the party, bringing joy and laughter wherever they go.",
      "religion": "Celebrate the natural world and the fey spirits that inhabit it.",
      "traditions": [
        "Music and dance festivals",
        "Seasonal feasts"
      ],
      "notable_figures": [],
      "relationships": [
        "Beloved by many for their joyful nature",
        "Often act as ambassadors between the fey and mortal realms"
      ],
      "example_image_paths": [
        "satyr_example.jpg"
      ],
      "custom_details": "Satyrs are known for their carefree and mischievous nature. They often play pranks on travelers but are generally good-natured.",
      "distribution": "Primarily found in the Astral Forests, with some residing in the Material Plane."
    },
    "Slothturtle": {
      "auto_link_strings": [
        "Slothturtle",
        "Slothturtles"
      ],
      "name": "Slothturtle",
      "type": "Astral",
      "origin": "Unknown, believed to be one of the oldest species in existence",
      "lifespan": "Immortal",
      "physique": "A unique combination of turtle and sloth characteristics. Extremely slow-moving creatures with both shell and fur. Young Slothturtles are arboreal, but transition to aquatic lifestyles as they age. Like Dragons, they continue growing throughout their immortal lives, with the oldest specimens reaching enormous sizes.",
      "languages": [],
      "custom_details": "Possess powerful divine energy despite their peaceful herbivorous nature. Their method of reproduction remains a mystery to all other species. While believed to be sentient and capable of telepathic communication among themselves, they have never been observed attempting communication with other species. They are completely immune to all forms of damage, illness, or injury - similar to demigods and Olympic items, but even more absolute in their invulnerability. The oldest and largest specimens are so rarely seen that many consider them mythical, though their existence has been confirmed by dragons and gods alike.",
      "homelands": "The Astral Plane",
      "other_regions": "Never found outside the Astral Plane. Some scholars believe their eggs manifest directly from the divine source itself, though this is not yet proven.",
      "distribution": "Rarely seen but found in various locations across the Astral Plane, typically in peaceful, isolated areas. They live solitary lives without any form of government or civilization. The largest specimens tend to inhabit the deepest, most remote regions of the Astral Plane.",
      "history": "Their origins are unknown, though they are believed to be one of the oldest species in existence. The only known end to their existence is through divine ascension, a process similar to enlightenment that occurs randomly throughout their lives.",
      "culture": "Solitary and contemplative. Show no interest in interaction with other species beyond peaceful coexistence. Despite their (evident) lack of communication, they appear to possess a deep wisdom that even the gods respect.",
      "religion": "Though divine in nature themselves, they show no observable religious practices",
      "traditions": [
        "Take approximately 1000 years to reach maturity, spending their early life in deep meditation and slow growth.",
        "The process of ascension involves the Slothturtle becoming completely motionless for several days before disappearing in a silent flash of white light."
      ],
      "notable_figures": [],
      "relationships": [
        "Peaceful coexistence with all species",
        "Never show aggression or attempt communication",
        "Often treated with reverence due to their divine nature",
        "Protected by most civilized societies due to their peaceful nature",
        "The Gods, though not legislatively bound to do so, will be known to act harshly against anyone who captures or otherwise interferes with a slothturtle in an excessive manner",
        "Dragons share a special kinship with them, as both species are immortal and continue growing throughout their lives"
      ],
      "example_image_paths": [
        "slothturtle_example.jpg",
        "slothturtle_example2.jpg"
      ],
      "average_size_range": "height: 30-1500 cm (1-50 ft), with the youngest being the size of a small dog and the oldest reaching sizes comparable to small buildings"
    },
    "Soulblight": {
      "auto_link_strings": [
        "Soulblight",
        "Soulblights"
      ],
      "name": "Soulblight",
      "page_header": "Soulblight Flower",
      "type": "Flora",
      "origin": "A plant infused with chaos and soul magic in the Feywilds",
      "homelands": "The far reaches of the Feywilds",
      "average_size_range": "height: roughly 1m when fully grown",
      "lifespan": "approximately 6 years",
      "example_image_paths": [
        "soulblight_example.jpg",
        "soulblight_notes.jpg"
      ],
      "custom_details": "Soulblights are thorn-covered, semi-sentient bushes that grow in the outer edges of the Feywilds, where chaos magic distorts reality and soul energy permeates the environment. Standing around a meter tall, a Soulblight resembles a warped, alien rosebush with irregular blossoms in shifting hues of blue, gray, and deep red. Its bark emits a faint magical glow, and its thorns can sometimes resemble crystalline spines. The blooms secrete a red, sap-like fluid that is magically conductive and used in ritual magic.\n\nSoulblights emit a distinct magical signature, highly reactive to soul-aspected energies. Prolonged exposure to the plant can affect a person’s dreams, memories, or emotional state. Their seeds are especially dangerous: when ground or distilled, they act as potent soul poison, capable of unraveling a creature’s spiritual essence without leaving a physical mark. For this reason, Soulblight seeds are highly restricted or banned in many magical societies.\n\nThough native to the Feywilds, their presence can warp nearby flora. Rumors persist that particularly large or old Soulblights have a limited awareness, turning slightly when watched or humming faintly in high magical winds. Fey botanists treat the plant with a blend of awe and caution, noting its usefulness in soul magic but warning of its unpredictable behavior near chaotic ley lines.",
      "other_regions": "Found with some collectors in the Astral and Mortal Planes, and very rare even within the Feywilds. They require specific growing conditions that are difficult to replicate, making them extremely valueable to the right people."
    },
    "Tiefling": {
      "auto_link_strings": [
        "Tiefling",
        "Tieflings"
      ],
      "name": "Tiefling",
      "type": "Humanoid",
      "origin": "Descended from an Orcish tribe that made dealings with creatures of the Feywilds",
      "lifespan": "750-1000 years",
      "physique": "Extremely varied in appearance, with the most physical diversity among mortal species. Skin tones span a wide spectrum including reds, oranges, purples, blues, and greens. All Tieflings possess horns. This variety is attributed to their inherent connection to chaos energy.",
      "languages": [
        "Infernal",
        "Sylvaric"
      ],
      "custom_details": "The only mortal species that regularly practices chaos magic, though it remains rare and difficult even among them. Their society is structured around seven ancient families who maintain control over the Isles of Tife. Family heads are chosen by the chaos gods themselves and receive power and boons in exchange for their service.",
      "homelands": "The Isles of Tife",
      "other_regions": "",
      "distribution": "",
      "history": "",
      "religion": "",
      "traditions": [
        "Family loyalty is paramount in Tiefling culture.",
        "Each of the seven families maintains its own traditions and ceremonies.",
        "Leadership succession within families is determined by divine selection rather than heredity."
      ],
      "notable_figures": [],
      "relationships": [
        "Face some prejudice in certain regions due to their infernal heritage - specifically in celestia where they are seen as a threat to the peace of the celestials, and they are not allowed to live in the celestian nation as permanent residents",
        "Maintain strong diplomatic ties with coastal nations through the Isles of Tife, mainly the humans in the land of kind and the elves in titanrock",
        "Generally respected for their magical abilities and cultural achievements",
        "Share particularly good relations with humans and elves due to similar physical ability to interbreed with them - also "
      ],
      "culture": "Strongly family-oriented, with the seven ruling families operating in a manner similar to organized crime syndicates. Their association with criminal elements and chaos magic often leads other societies to view Tiefling groups with suspicion.",
      "example_image_paths": [
        "tiefling_example.jpg"
      ],
      "average_size_range": "height: 150-230 cm (4'11\"-7'7\")"
    }
  }
}