{
  "config": {
    "base_path": "docs/species",
    "template": "_templates/species_template.md"
  },
  "items": {
    "Celestial": {
      "auto_link_strings": [
        "Celestial",
        "Celestials"
      ],
      "name": "Celestials",
      "type": "Humanoid",
      "origin": "Transformed Elves, blessed by interdimensional beings known as angels",
      "lifespan": "750-1000 years",
      "physique": "Similar to Elves in basic form, but distinguished by large feathered wings, more dramatically pointed ears, and eyes that emit a soft glow. Their features tend to be more angular than their Elven ancestors.",
      "languages": [
        "Celestial",
        "Sylvaric"
      ],
      "custom_details": "",
      "homelands": "Celestia",
      "other_regions": "",
      "distribution": "",
      "history": "",
      "religion": "",
      "traditions": "",
      "notable_figures": [],
      "relationships": [
        "Ongoing territorial disputes with Dragonborn",
        "Viewed as arrogant by many species, particularly Dwarves",
        "Maintain diplomatic but distant relations with most other species",
        "Often seen as aloof by mortal races"
      ],
      "example_image_paths": [],
      "average_size_range": "height: 160-206 cm (5'3\"-6'9\")"
    },
    "Demigod": {
      "auto_link_strings": [
        "Demigod",
        "Demigods"
      ],
      "name": "Demigods",
      "type": "Amorphous",
      "origin": "Born from the union of gods and mortals",
      "lifespan": "Immortal",
      "physique": "In their natural form, they appear as black amorphous sludge. Most use control masks (typically white porcelain) to maintain humanoid form, though these aren't required. Their 'clothing' is actually formed from their own substance, usually appearing as black garments with no visible skin.",
      "languages": [
        "Sylvaric"
      ],
      "custom_details": "Completely invulnerable to all forms of damage or harm. While control masks help maintain humanoid form, Demigods can shape their amorphous bodies at will. The white porcelain mask and black clothing appearance is their most common chosen form.",
      "homelands": "",
      "other_regions": "",
      "distribution": "",
      "history": "",
      "religion": "",
      "traditions": "",
      "notable_figures": [],
      "relationships": [
        "Complex relationships with their divine and mortal parentage",
        "Very often seen with distrust because of their chaotic and unpredictable nature also because of their fondness of alchemy",
        "Frequently seen with the Fey, due to their similar chaotic and unpredictable nature"
      ],
      "example_image_paths": [],
      "average_size_range": "N/A - amorphous form can take any size though they maintain the same mass of around 100kg"
    },
    "Dragon": {
      "auto_link_strings": [
        "Dragon",
        "Dragons"
      ],
      "name": "Dragons",
      "type": "Beast",
      "origin": "All dragons are descendants of the primordial dragon Fafnir, native to the Astral Plane",
      "lifespan": "Immortal",
      "physique": "Come in several distinct forms: serpentine dragons with four limbs, long bodies and multiple wing sets; stocky four-limbed dragons with two wings; and two-legged variants with prehensile wing-appendages.",
      "languages": [
        "Draconic",
        "Sylvaric"
      ],
      "custom_details": "Highly intelligent and magical beings who reproduce asexually and do not associate with gender. Like other the slothturtles, they continue growing throughout their immortal lives. Their proud and noble nature has shaped much of their history and interactions with other species.",
      "homelands": "The Astral Plane",
      "other_regions": "no dragons permanently live outside of the astral plane due to self-imposed exile",
      "distribution": "Primarily inhabit the Astral Plane, though historically some groups migrated to the material plane. Those who remained in the mortal realm became tyrannical rulers until their eventual defeat.",
      "history": "Originally all dragons lived in the Astral Plane. Millennia ago, some migrated to the material plane where they established dominion over large territories. The more cruel among them remained to rule over mortals, leading to their eventual disownment by their Astral kin. These terrestrial dragons were ultimately defeated by the sparkbearer Asher, whose revolution ended their reign. The region most affected by dragon rule became Rositoria, named after Asher.",
      "religion": "The dragons are not religious, but they do hold the sparkbearer Asher in high regard - they are also practicers of necromancy and talk with the dead often in religious ceremonies - there are also sections who worship the members of the dragongod pantheon - though they are not worshipped as gods, but as legendary or wise figures",
      "traditions": "Have complex customs regarding territory, hierarchy, and interaction with mortals. Most traditions stem from preventing the abuse of power that led to the fall of the material plane dragons.",
      "notable_figures": [],
      "relationships": [
        "Share special connection with Dragonborn due to the dragongift blessing",
        "Generally maintain far distance from mortal affairs due to historical conflicts",
        "Respected and often feared by most species",
        "Sometimes serve as neutral mediators in major conflicts",
        "Maintain strict separation between Astral and former material plane dragons",
        "Hold deep respect for the sparkbearer Asher despite his role in ending dragon rule"
      ],
      "culture": "Highly individualistic yet maintain strong traditions. The Astral dragons particularly value nobility and responsible use of power, learned from the cautionary tale of their material plane kin. Violent and aggressive dragons are often ostracized from their kind, and are often hunted by the Astral dragons. The dragons do protect their own kind though, and will come to their defense if harmed. They believe dragons should be judged by their own kind, not by mortals.",
      "example_image_paths": [],
      "average_size_range": "length: 366-1219 cm (12'0\"-40'0\") with extreme outliers. Weight: newborn 1-1.5 kg (2-3 lbs), adult average 1800 kg (2 tons), ancient specimens reaching several dozen tons"
    },
    "Dragonborn": {
      "auto_link_strings": [
        "Dragonborn"
      ],
      "name": "Dragonborn",
      "type": "Humanoid",
      "origin": "Divine Blessing placed by the dragon god Shal'nan on her human followers",
      "lifespan": "80-150 years",
      "physique": "Humanoid with reptilian features including scales, which provide natural magical resilience. Their appearance is a result of the Dragongift blessing.",
      "languages": [
        "Draconic",
        "Sylvaric"
      ],
      "custom_details": "The Dragongift not only transformed their physical appearance but also granted them innate knowledge of dragon magic.",
      "homelands": "Shal'nan (nation)",
      "other_regions": "About half of the Dragonborn population lives outside Shal'nan, scattered across various regions of the world. Very few Dragonborn live in the celestia though, Given the tensions between the two species.",
      "distribution": "Tend to live in small village communities, even outside their homeland",
      "history": "The Dragonborn came into being when the dragon god Shal'nan blessed her human followers with what is now known as the Dragongift.",
      "religion": "Most Dragonborn worship either nature deities or the Dragongods pantheon, particularly Quetzalcoatl and Shal'nan",
      "traditions": "The Journey of Insight - Young Dragonborn (ages 20-25) embark on worldwide travels",
      "notable_figures": [],
      "relationships": [
        "Generally maintain good relations with most species",
        "Have ongoing territorial disputes with Celestials",
        "Share mutual respect with Dwarves for their respective crafts",
        "Maintain peaceful trade relations with most other nations"
      ],
      "example_image_paths": [],
      "average_size_range": "height: males 188 cm (6'2\"), females 201 cm (6'7\")"
    },
    "Dwarf": {
      "auto_link_strings": [
        "Dwarf",
        "Dwarves",
        "Dwarven"
      ],
      "name": "Dwarves",
      "type": "Humanoid",
      "origin": "Share a common ancestor with Elves, believed to be the second oldest sentient species after Elves",
      "lifespan": "200-400 years",
      "physique": "",
      "languages": [
        "Dwarven",
        "Sylvaric"
      ],
      "custom_details": "Masters of metalwork and maritime trade, Dwarves have established themselves as the premier craftspeople of Sylvarus, particularly in metallurgy and stonework. Their influence on global trade through their powerful merchant fleets is nearly as significant as their mastery of crafting. Have detailed treaties with Halflings regarding lumber harvesting in the Northwest Tundra, including strict sustainability rules requiring two trees planted for each one cut and limits on trees per acre.",
      "homelands": "Kamboramm",
      "other_regions": "Outside of Kamboramm, significant Dwarven populations can be found in Rositoria and Mideer, with smaller communities scattered throughout other nations.",
      "distribution": "While primarily concentrated in Kamboramm, Dwarven craftspeople can be found throughout most nations, typically working as smiths, masons, and other skilled trades. Though capable in all professions, they culturally prefer hands-on work over administrative roles.",
      "history": "The Dwarves built their civilization on the twin pillars of craftsmanship and seafaring, developing into one of the most economically influential species through their control of maritime trade routes and high-quality metalwork production.",
      "culture": "Dwarven culture emphasizes durability and permanence, reflected in their stone architecture and metalwork. Despite their reputation for stoic craftsmanship, they are known for their warm hospitality and becoming particularly friendly when drinking.",
      "traditions": [
        "Lunar calendar celebrations throughout the year",
        "Historical anniversary commemorations",
        "Extensive drinking festivals",
        "Crafting competitions and exhibitions",
        "Maritime trade festivals"
      ],
      "architecture": "Dwarven cities are masterworks of stone architecture, with minimal use of wood except in their impressive naval fleets. Their settlements are known for their durability and impressive engineering.",
      "religion": "Generally secular in outlook, viewing gods more as powerful wizards than divine beings. While they honor their ancestors and celebrate legendary craftspeople and heroes, they typically don't worship them. Their respect for achievement and mastery tends to be practical rather than religious in nature.",
      "notable_figures": [],
      "relationships": [
        "Historical tensions with Elves over resource disputes and cultural differences",
        "View Humans as capable but naive, willing to work together but rarely under human leadership",
        "Consider Celestials to be even more arrogant than Elves",
        "Hold deep respect for Halfling magic and peaceful, sustainable, and self-sufficient ways",
        "Admire Dragonborn courage and martial prowess",
        "Particularly respect Orcish craftsmanship",
        "Maintain strong suspicion of Fey and Fairies",
        "Protect Halfling territories in exchange for regulated lumber access"
      ],
      "example_image_paths": [],
      "average_size_range": "height: 107-137 cm (3'6\"-4'6\")"
    },
    "Elf": {
      "auto_link_strings": [
        "Elf",
        "Elves",
        "Elvish"
      ],
      "name": "Elves",
      "type": "Humanoid",
      "origin": "Evolutionary Digergence",
      "lifespan": "750-1000 years",
      "physique": "Usually more slender than humans, agile, with pointed ears and sharp facial features. Skin tones range from pale silver to deep forest green, to charcoal black depending on subrace.",
      "languages": [
        "Elvish",
        "Sylvaric"
      ],
      "custom_details": "",
      "homelands": "Taliander",
      "other_regions": "Widely spread across Sylvarus, second only to humans - usually stays on the western continent",
      "distribution": "",
      "history": "Elves are believed to be among the first sentient species to walk the surface of Sylvarus. Their history claims they were shaped from song and moonlight by a forgotten celestial being. Their early history is closely tied to the Feywild.",
      "religion": "Primarily worship deities of nature, stars, and the arcane.",
      "traditions": "Seasonal festivals, moon rites, coming-of-age quests.",
      "notable_figures": [],
      "relationships": [
        "Tense history with Dwarves due to resource disputes and cultural clashes",
        "Relatively peaceful relations with Humans",
        "Ongoing conflict with Dwarves stems from fundamentally different approaches to nature and resources"
      ],
      "example_image_paths": [],
      "average_size_range": "height: 160-206 cm (5'3\"-6'9\")"
    },
    "Fairy": {
      "auto_link_strings": [
        "Fairy",
        "Fairies"
      ],
      "name": "Fairies",
      "type": "Humanoid",
      "origin": "Hybrid offspring of Fey and mortals",
      "lifespan": "Immortal",
      "physique": "Small in stature, combining traits of their mortal parent with Fey characteristics - notably thin builds and dark blood. Their appearance varies widely based on their mortal parentage.",
      "languages": [
        "Feyspeak",
        "Sylvaric"
      ],
      "custom_details": "Possess an innate connection to chaos magic, allowing them limited influence over probability. This connection is inherited from their Fey parent but is typically less potent than pure Fey abilities.",
      "homelands": "The Feywilds",
      "other_regions": "",
      "distribution": "Most Fairies congregate in the central city of the Feywilds, where the chaos beasts are less prevalent. This creates a vibrant community mixing Fey and Fairy culture.",
      "history": "Fairies emerged as a species through the union of Fey with various mortal races. Their existence bridges the gap between the chaotic nature of the Feywilds and the ordered world of mortals.",
      "religion": "Varied, often influenced by their mortal parent's culture, though many maintain a deep spiritual connection to the chaotic forces of the Feywilds.",
      "traditions": "Like their Fey parents, they have a strong affinity for celebration, gambling, and artistic pursuits. Their fashion sense is distinctly bold and colorful, with hats being particularly important in their attire.",
      "notable_figures": [],
      "relationships": [
        "Find Dwarven distrust amusing but generally respect their wishes to be left alone",
        "Most Fairies avoid Dwarven settlements out of courtesy",
        "Some are known to be quite intentionally mischievous towards dwarves",
        "Share close bonds with Fey communities",
        "Generally welcomed in most mortal settlements due to their magical abilities"
      ],
      "culture": "Share the Fey's love for vibrant clothing, unique fashion, and elaborate hats. Music plays a central role in their society, and they often blend mortal musical traditions with Fey influences.",
      "example_image_paths": [],
      "average_size_range": "height: 91-107 cm (3'0\"-3'6\")"
    },
    "Fey": {
      "auto_link_strings": [
        "Fey"
      ],
      "name": "Fey",
      "type": "Amorphous",
      "origin": "Transformed mortal souls from before the creation of the Underworld",
      "lifespan": "Immortal",
      "physique": "Extremely varied in form, but universally characterized by very dark grey, almost black flesh and unnaturally thin bodies. They also all exclusively have eyes which glow a dim white constantly. Forms range from nearly humanoid to wildly alien, featuring multiple limbs, tentacles, or other unusual appendages.",
      "languages": [
        "Feyspeak",
        "Sylvaric"
      ],
      "custom_details": "Cannot reproduce among themselves but the more humanoid fey can breed with most mortal species, resulting in Fairy offspring. Possess powerful innate chaos magic. Most Fey have lost memories of their mortal lives due to the corrupting influence of the Feywilds over time, though they retain their core personalities and names. Their otherworldly nature and the loss of their past often makes them seem unsettling to mortals.",
      "homelands": "The Feywilds",
      "other_regions": "",
      "distribution": "Most Fey now reside in the central city of the Feywilds, where chaos beasts are less common. Their population is slowly declining since the creation of the Underworld halted the formation of new Fey.",
      "history": "Before Hades constructed the Underworld, mortal souls would fall into the Feywilds upon death. These souls, corrupted by the plane's inherent chaos, were transformed into the first Fey. The chaos surrounding their souls formed their varied physical forms.",
      "religion": "Their relationship with death and chaos shapes their worldview, though traditional religious worship is uncommon among them.",
      "traditions": "Heavily focused on entertainment and artistic pursuits. Having no need for food, they spend much of their time drinking, using various substances, engaging with literature and music, or gambling.",
      "notable_figures": [],
      "relationships": [
        "Maintain a mutual distance with Dwarves, who avoid their realm",
        "Find their mistrust somewhat entertaining",
        "Share close bonds with Fairies due to their hybrid nature",
        "Generally avoided by most mortal species due to their unsettling nature",
        "Known to occasionally trade with brave merchants seeking exotic goods"
      ],
      "culture": "Despite their dark appearance, Fey are known for wearing extremely colorful and uniquely styled clothing, with hats being particularly important in their fashion. They have a deep appreciation for music and the arts.",
      "example_image_paths": [
        "fey_example1.jpg",
        "fey_example2.jpg"
      ],
      "average_size_range": "height: typically 91-213 cm (3'0\"-7'0\"), but variations extend well beyond this range"
    },
    "Halfling": {
      "auto_link_strings": [
        "Halfling",
        "Halflings"
      ],
      "name": "Halflings",
      "type": "Humanoid",
      "origin": "Descended from humans in ancient times",
      "lifespan": "180-200 years",
      "physique": "Hardy constitution despite their small size, with resistance to cold weather. Unlike their human ancestors, they have proportionally larger hands and feet, but retain rounded ears.",
      "languages": [
        "Sylvaric"
      ],
      "custom_details": "Possess a natural affinity for magic and are known for their exceptional cooking abilities. Their underground homes are marvels of engineering, combining comfort with protection from the harsh tundra climate. Skilled at adapting to their harsh environment, particularly notable in their persistent attempts to grow tropical spices in cold climates. Their primary import is exotic spices, though they've had varying success in cultivating their own. When forced to defend themselves, they rely on their natural magical aptitude and skill with quarterstaffs. Obtain most of their metal goods and jewelry through lumber trade with the Dwarves. Practice strict veganism, avoiding all products that require animal death, though they do consume eggs from quail and chickens, and goat milk.",
      "homelands": "Northwest Tundra",
      "other_regions": "",
      "distribution": "Live primarily in small, interconnected underground towns across the tundra region. Their settlements are connected by elaborate tunnel networks.",
      "history": "",
      "culture": "Value comfort, good food, and peaceful living. Their society revolves around communal gatherings and celebrations, with cooking and crafting being central to their way of life. Their vegan lifestyle extends to avoiding leather, furs, and other animal products that require killing.",
      "traditions": "Host elaborate multi-day celebrations for weddings, births, and funerals. Mark the equinoxes and solstices with grand feasts and drinking celebrations. Known for their ability to turn any gathering into a feast.",
      "notable_figures": [],
      "relationships": [
        "Universally respected by other species for their peaceful way of life",
        "Remote location and non-confrontational nature has helped avoid most conflicts",
        "Have a particularly strong relationship with the Dwarves through lumber trade",
        "Receive military protection from Dwarves in exchange for regulated lumber access",
        "Known for fair and honest dealings in all trade relationships"
      ],
      "example_image_paths": [
        "halfling_example1.jpg"
      ],
      "average_size_range": "height: 100-150 cm (3.3-4.9 ft)"
    },
    "Human": {
      "auto_link_strings": [
        "Human",
        "Humans",
        "Humanity"
      ],
      "name": "Humans",
      "type": "Humanoid",
      "origin": "Evolutionary Divergence, more closely related to Dwarves than Elves",
      "lifespan": "80-150 years",
      "physique": "A mix of Dwarven and Elvish physiques, stockier than elves but less than dwarves. Known for their circled ears and running endurance. Skin tones have a relatively small range, from light pinkish to dark brown depending on the subrace",
      "languages": [
        "Sylvaric"
      ],
      "custom_details": "",
      "homelands": "Noridge",
      "other_regions": "The most widespread species - you can find humans in every nation and territory outside of Athenia, though there are concentrations of them in some nations",
      "distribution": "",
      "history": "Humans are believed to be a descendant species of the elves, the reason for their short life-spans is unknown, a long time legend is that they were blessed by an ancient god to give them a sense of urgency and importance around time",
      "religion": "Primarily worships the olypmians",
      "traditions": "Bartering, humans love bartering and finding deals  \nWinter festivals  \n Gift Giving",
      "notable_figures": [],
      "relationships": [
        "Tense history with Orcs due to human subjugation of Orcs during the Age of Unity",
        "Most conflicts occur between human nations rather than with other species",
        "Generally more diplomatic with other species than with their own kind",
        "Maintain peaceful trade relations with most races"
      ],
      "example_image_paths": [],
      "average_size_range": "height: 152-198 cm (5'0\"-6'6\")"
    },
    "Orc": {
      "auto_link_strings": [
        "Orc",
        "Orcish",
        "Orcs"
      ],
      "name": "Orcs",
      "type": "Humanoid",
      "origin": "Evolutionary Divergence from a common ancestor with Elves, more closely related to Elves than to Dwarves",
      "lifespan": "80-150 years",
      "physique": "Similar build to elves but significantly more muscular. Known for their green-grey skin and tusks that protrude from their lower jaw.",
      "languages": [
        "Sylvaric",
        "Orcish"
      ],
      "custom_details": "",
      "homelands": "Athenia",
      "other_regions": "The overwhelming majority of Sylvarus' Orcs live in Athenia - Though you can find wanderers, diplomats, and explorers here and there in every nation and region of Sylvarus. Most are temporary residents and will return to Athenia. The most common Orcs you will find outside of their homeland are hunters. They search for magical artifacts on the dime of the Athenian government and take them back home.",
      "distribution": "",
      "history": "Humans are believed to be a decendant species of the elves, the reason for their short life-spans is unknown, a long time legend is that they were blessed by an ancient god to give them a sense of urgency and importance around time",
      "religion": "Primarily worships the the Divine Parents, Iranara and Orakothros",
      "traditions": "Homecoming - The Orcish homecoming is a tradition where Orcs who are outside of their hometown return to give birth and stay there for 4 years",
      "notable_figures": [],
      "relationships": [
        "Historical tension with Humans due to subjugation during the Age of Unity",
        "Generally peaceful but guarded in their dealings with other species",
        "Known to respond with overwhelming force if attacked",
        "Prefer to stay out of others' conflicts"
      ],
      "example_image_paths": [],
      "average_size_range": "height: 188 cm (6'2\") with no sexual dimorphism"
    },
    "Quall": {
      "auto_link_strings": [
        "Quall"
      ],
      "name": "Quall",
      "type": "Humanoid",
      "origin": "",
      "lifespan": "80-150 years",
      "physique": "",
      "languages": [
        "Quallish"
      ],
      "custom_details": "",
      "homelands": "Parallel Sylvarus",
      "other_regions": "None known",
      "distribution": "They live in a parallel version of Sylvarus, which exists in a parallel universe",
      "history": "They are the only sentient species in their world",
      "religion": "The power of the quall gods is immense due to the quall devotion to them, quallish gods historically have established cults and theocracies, and also known to kill sparkbearers. This is done to avoid competition from any new gods",
      "traditions": "full devotion to the quall gods which influences their culture and traditions, including religious ceremonies, traditions, and holidays. The clergy class is the most powerful class in quall society, and they are the only ones who can communicate with the quall gods. The clergy class is also the only class that can use the divine magic of the quall gods.",
      "notable_figures": [],
      "relationships": [
        "No major relationships with other species as they are the only sentient species in their world",
        "Only really known due to the experience of multiversal travelers - especialy the Quall God Delinette, who ascending in Sylvarus after he travels"
      ],
      "example_image_paths": [],
      "average_size_range": "height: 152 cm (5'0\") with no sexual dimorphism"
    },
    "Slothturtle": {
      "auto_link_strings": [
        "Slothturtle",
        "Slothturtles"
      ],
      "name": "Slothturtles",
      "type": "Beast",
      "origin": "",
      "lifespan": "Immortal",
      "physique": "A unique combination of turtle and sloth characteristics. Extremely slow-moving creatures with both shell and fur. Young Slothturtles are arboreal, but transition to aquatic lifestyles as they age.",
      "languages": [],
      "custom_details": "Possess powerful divine energy despite their peaceful herbivorous nature. Their method of reproduction remains a mystery to all other species. While believed to be sentient and capable of telepathic communication among themselves, they have never been observed attempting communication with other species. They are completely immune to all forms of damage, illness, or injury - similar to demigods and Olympic items, but even more absolute in their invulnerability.",
      "homelands": "The Astral Plane",
      "other_regions": "Never found outside the Astral Plane. Some scholars believe their eggs manifest directly from the divine source itself, though this is not yet proven.",
      "distribution": "Rarely seen but found in various locations across Sylvarus, typically in peaceful, isolated areas. Most commonly found in the Astral Plane, living solitary lives without any form of government or civilization.",
      "history": "Their origins are unknown, though they are believed to be one of the oldest species in existence. The only known end to their existence is through divine ascension, a process similar to enlightenment that occurs randomly throughout their lives.",
      "culture": "Solitary and contemplative. Show no interest in interaction with other species beyond peaceful coexistence.",
      "religion": "Though divine in nature themselves, they show no observable religious practices",
      "traditions": "Take approximately 1000 years to reach maturity, spending their early life in deep meditation and slow growth. The process of ascension involves the Slothturtle becoming completely motionless for several days before disappearing in a silent flash of white light. Sites of ascension become areas of extraordinary fertility and healing, with accelerated plant growth and enhanced healing properties that can last up to ten years.",
      "notable_figures": [],
      "relationships": [
        "Peaceful coexistence with all species",
        "Never show aggression or attempt communication",
        "Often treated with reverence due to their divine nature",
        "Protected by most civilized societies due to their peaceful nature",
        "The Gods, though not legislatively bound to do so, will be known to act harshly against anyone who captures or otherwise interferes with a slothturtle in an excessive manner"
      ],
      "example_image_paths": [],
      "average_size_range": "height: 150-200 cm (4.9-6.6 ft)"
    },
    "Tiefling": {
      "auto_link_strings": [
        "Tiefling",
        "Tieflings"
      ],
      "name": "Tieflings",
      "type": "Humanoid",
      "origin": "Descended from an Orcish tribe that made dealings with creatures of the Feywilds",
      "lifespan": "750-1000 years",
      "physique": "Extremely varied in appearance, with the most physical diversity among mortal species. Skin tones span a wide spectrum including reds, oranges, purples, blues, and greens. All Tieflings possess horns. This variety is attributed to their inherent connection to chaos energy.",
      "languages": [
        "Infernal",
        "Sylvaric"
      ],
      "custom_details": "The only mortal species that regularly practices chaos magic, though it remains rare and difficult even among them. Their society is structured around seven ancient families who maintain control over the Isles of Tife. Family heads are chosen by the chaos gods themselves and receive power and boons in exchange for their service.",
      "homelands": "The Isles of Tife",
      "other_regions": "",
      "distribution": "",
      "history": "",
      "religion": "",
      "traditions": "Family loyalty is paramount in Tiefling culture. Each of the seven families maintains its own traditions and ceremonies, though all share a common reverence for their chaos god patrons. Leadership succession within families is determined by divine selection rather than heredity.",
      "notable_figures": [],
      "relationships": [
        "Face some prejudice in certain regions due to their infernal heritage - specifically in celestia where they are seen as a threat to the peace of the celestials, and they are not allowed to live in the celestian nation as permanent residents",
        "Maintain strong diplomatic ties with coastal nations through the Isles of Tife, mainly the humans in the land of kind and the elves in titanrock",
        "Generally respected for their magical abilities and cultural achievements",
        "Share particularly good relations with humans and elves due to similar physical ability to interbreed with them - also "
      ],
      "culture": "Strongly family-oriented, with the seven ruling families operating in a manner similar to organized crime syndicates. Their association with criminal elements and chaos magic often leads other societies to view Tiefling groups with suspicion.",
      "example_image_paths": [],
      "average_size_range": "height: 150-200 cm (4.9-6.6 ft)"
    },
    "Narn": {
      "auto_link_strings": [
        "Narn",
        "Narns"
      ],
      "name": "Narns",
      "type": "Humanoid",
      "origin": "Native to southern Sylvarus",
      "lifespan": "Extended compared to humans",
      "physique": "Giants with immense physical strength and durability. Significantly larger than most other humanoid species.",
      "languages": [
        "Narnish",
        "Sylvaric"
      ],
      "custom_details": "Practitioners of a unique form of magic that binds the soul to the bloodstream, igniting divine energy within the body. This Narn magic is sacred, dangerous, and rarely taught to outsiders. Adult Narns are immune to most poisons and illnesses, though their children remain susceptible. Like all sentient beings, Narns can be chosen as Sparkbearers - individuals with divine sparks destined for godhood if they complete their unique trials.",
      "homelands": "Southern regions of Sylvarus, particularly Narnlund",
      "other_regions": "",
      "distribution": "Primarily concentrated in their homeland, with few venturing far from their territories",
      "history": "The Narns have a long history of honorable kingship and adherence to strict codes of conduct. Their society has remained relatively stable due to their emphasis on wisdom in leadership.",
      "religion": "While they acknowledge the gods, their primary spiritual focus is on living and dying with honor. Sparkbearers among them are treated with respect but not worshipped.",
      "traditions": "Open challenges to leadership through honorable combat, where defeating a king grants the challenger the king's treasures. Emphasis on honorable life and death permeates all aspects of their culture.",
      "notable_figures": [],
      "relationships": [
        "Closest alliance with Humans, with whom they share mutual respect",
        "Hold fierce respect for Dragonborn warriors and their martial prowess",
        "Generally cold and distant toward most other species",
        "Value honor and strength in their interactions with all races"
      ],
      "example_image_paths": [],
      "average_size_range": "height: 300-400 cm (9'10\"-13'1\")"
    }
  }
}