{
  "config": {
    "base_path": "docs/entities/titans",
    "template": "_templates/titan_template.md"
  },
  "items": {
    "Aliqotash": {
      "auto_link_strings": [
        "Aliqotash",
        "The Wise Titan"
      ],
      "name": "Aliqotash",
      "pronouns": "he/him",
      "aliases": [
        "The Wise Titan"
      ],
      "species": "Titan",
      "time_period_of_fall": "",
      "relationships": [
        "Served as advisor to Hades",
        "Executed by Thanatos per own request"
      ],
      "current_status": "Deceased - Executed by Thanatos",
      "history": "The most powerful titan ever held in captivity, who voluntarily submitted to imprisonment in Tartarus. Served as Hades' advisor on titan matters before eventually succumbing to madness.",
      "image_path": "aliqotash.jpg",
      "description": "A powerful titan who chose imprisonment to protect others from potential harm",
      "custom_details": "Requested his own execution by Thanatos should he lose his sanity, which eventually came to pass",
      "lgbtq_identifications": [],
      "other_identifiers": [],
      "music_path": "",
      "song_name": "",
      "pre_fall_species": "Tiefling",
      "divine_trial": "Unknown"
    },
    "Hydraxus": {
      "auto_link_strings": [
        "Hydraxus",
        "The Stoic Dragon"
      ],
      "name": "Hydraxus",
      "pronouns": "they/them",
      "aliases": [
        "The Stoic Dragon"
      ],
      "species": "Dragon Titan",
      "time_period_of_fall": "",
      "relationships": [
        "Known for peaceful interactions with other beings"
      ],
      "current_status": "Active - Peaceful",
      "history": "A former sparkbearing dragon who refused to complete their trial on moral grounds, believed to involve conquest or killing. Maintained their pacifist nature even after becoming a titan.",
      "image_path": "hydraxus.jpg",
      "description": "A pacifist dragon titan who refused their trial on moral grounds",
      "custom_details": "One of the few titans who remain calm and communicative, maintaining their peaceful nature even in titan form - and has kept from succumbing to titan madness ",
      "lgbtq_identifications": [],
      "other_identifiers": [
        "Pacifist"
      ],
      "music_path": "",
      "song_name": "",
      "pre_fall_species": "Dragon",
      "divine_trial": "Unknown"
    },
    "Krella": {
      "auto_link_strings": [
        "Krella",
        "The Mad Spider"
      ],
      "name": "Krella",
      "pronouns": "she/her",
      "aliases": [
        "The Mad Spider"
      ],
      "species": "Titan",
      "time_period_of_fall": "Pre-Thanatos Era",
      "relationships": [
        "Killed by twin sister (a sparkbearer who's name is lost to history)",
        "Executed by Hades"
      ],
      "current_status": "Deceased - Executed by Hades",
      "history": "A young sparkbearer turned titan after being killed by their twin sister. Lost all rationality and rampaged through the Feywilds seeking revenge before being personally executed by Hades.",
      "image_path": "krella.jpg",
      "description": "A young titan driven mad by betrayal, killed by Hades before Thanatos took on the role of titan executioner",
      "custom_details": "One of the few titans personally killed by Hades rather than Thanatos",
      "lgbtq_identifications": [],
      "other_identifiers": [],
      "music_path": "",
      "song_name": "",
      "pre_fall_species": "Human",
      "divine_trial": "Unknown"
    },
    "Nemia": {
      "auto_link_strings": [
        "Nemia",
        "The Nemian Lion"
      ],
      "name": "Nemia",
      "pronouns": "she/they",
      "aliases": [
        "The Nemian Lion"
      ],
      "species": "Titan",
      "time_period_of_fall": "",
      "relationships": [
        "Last titan encountered by Artemis during Artemis's divine trial",
        "Captured and banished to the Astral Plane by Artemis"
      ],
      "current_status": "Active - Safely in Tartarus",
      "history": "The final titan encountered by Artemis during Her divine trial to eliminate titans from the Feywilds. Unlike all other titans who were slain, Nemia was uniquely spared and instead captured and banished to the Astral Plane. Artemis believed the gods would contain Nemia there, preventing any threat to the Feywilds. And she was right - Nemia was captured by Hades and Eris and imprisoned in Tartarus. Despite being consumed by titan madness and reduced to a near-bestial state mentally, they retain their formidable spellcasting abilities and magical knowledge. Nemia is known for her extraordinary power and resilience, and they are the only surviving titan from Artemis's purge of the feywilds.",
      "image_path": "nemia.jpg",
      "description": "An incredibly powerful titan who was banished to the Astral Plane rather than slain during Artemis's purge. Has nearly invincible skin and is known to be able to withstand attack from even the gods. Despite their beast-like mental state from titan madness, they retain their vast spellcraft knowledge and capabilities.",
      "custom_details": "Possesses extraordinary power that has allowed them to survive where other titans have fallen. Unique among titans for maintaining their magical abilities despite succumbing to titan madness.",
      "lgbtq_identifications": [
        "Demigirl"
      ],
      "other_identifiers": [],
      "music_path": "",
      "song_name": "",
      "pre_fall_species": "Dwarf",
      "divine_trial": "Unknown"
    },
    "Odysseus": {
      "auto_link_strings": [
        "Odysseus"
      ],
      "name": "Odysseus",
      "pronouns": "he/him",
      "aliases": [
        "The Uncorrupted"
      ],
      "species": "Titan",
      "time_period_of_fall": "The Period of Rebirth",
      "relationships": [
        "Maintains peaceful relations with Hades",
        "Has agreed to voluntary imprisonment if corruption manifests"
      ],
      "current_status": "Active - Uncorrupted",
      "history": "A unique case among titans, Odysseus somehow avoided the corruption typically associated with the fall. He lives peacefully in the Astral Plane, though maintains an agreement with Hades for voluntary imprisonment should he ever begin to show signs of madness.",
      "image_path": "odysseus.jpg",
      "description": "A titan who mysteriously avoided the corruption of the fall",
      "custom_details": "The reason for his immunity to titan corruption remains unknown, making him a subject of great interest to those studying titan nature",
      "lgbtq_identifications": [
        "Pansexual"
      ],
      "other_identifiers": [],
      "music_path": "",
      "song_name": "",
      "pre_fall_species": "Human",
      "divine_trial": "Unknown"
    },
    "Ombrim": {
      "auto_link_strings": [
        "Ombrim",
        "The Split One"
      ],
      "name": "Ombrim",
      "pronouns": "he/him",
      "aliases": [
        "The Split One"
      ],
      "species": "Titan/Lich Hybrid",
      "time_period_of_fall": "",
      "relationships": [
        "Spared by Artemis due to unique nature"
      ],
      "current_status": "Active - Split between titan and lich forms",
      "history": "A sparkbearer who attempted to escape titanhood by becoming a lich, resulting in a split existence between a flaming skeletal titan form and a lich form retaining his original personality.",
      "image_path": "ombrim.jpg",
      "description": "An eternally burning skeletal titan whose soul is split between their titan form and lich form",
      "custom_details": "His split nature often results in internal conflict, making decisive action difficult",
      "lgbtq_identifications": [],
      "other_identifiers": [],
      "music_path": "",
      "song_name": "",
      "pre_fall_species": "Elf",
      "divine_trial": "Unknown"
    },
    "Set": {
      "auto_link_strings": [
        "Set^titan"
      ],
      "name": "Set",
      "pronouns": "he/him",
      "aliases": [],
      "species": "Titan",
      "time_period_of_fall": "Pre-Divine Law Era",
      "relationships": [
        "Attempted to destroy Athena's city, leading to his execution"
      ],
      "current_status": "Deceased - Executed by Athena",
      "history": "A sparkbearer who became a titan and destroyed one of Athena's cities. His actions and subsequent execution by Athena led to the creation of divine laws preventing gods from directly interfering with sparkbearers.",
      "image_path": "set.jpg",
      "description": "A titan whose actions and subsequent execution by Athena resulted in significant changes to divine law",
      "custom_details": "His death marked a significant change in divine law, establishing the prohibition of gods interfering with sparkbearers",
      "lgbtq_identifications": [],
      "other_identifiers": [],
      "music_path": "",
      "song_name": "",
      "pre_fall_species": "Human",
      "divine_trial": "Unknown"
    }
  }
}