{
  "config": {
    "base_path": "docs/entities/fidari",
    "template": "_templates/entities/fidari_template.md_template",
    "type": "entity",
    "subtype": "fidari"
  },
  "items": {
    "The_Smiling_God": {
      "auto_link_strings": [
        "The Smiling God"
      ],
      "name": "the_smiling_god",
      "page_name": "The Smiling God",
      "pronouns": "they/them",
      "image_path": "../images/the_smiling_god.jpg",
      "aliases": [
        "The Joyfather",
        "Bearer of Grins",
        "The Marble Smile"
      ],
      "manifestation_origin": "A small community volunteer group devoted to bringing joy and gratitude to their neighborhood.",
      "manifestation_vessel": "A statue of a smiling creature, once symbolic, eventually became the physical form of the Fidari.",
      "first_appearance_time_period": "Unknown; believed to have first manifested several thousand years ago and has resurfaced many times since.",
      "lgbtq_identifications": [
        "agender"
      ],
      "other_identifiers": [
        "neurodivergent"
      ],
      "song_name": "Dessert Bluffs - Music Box Version",
      "song_link": "https://youtu.be/uE4GE9gKyBw?si=k0RHv3ISBWm7pxT0",
      "custom_details": "**Cult Behavior:** Followers are relentlessly cheerful and grateful. Frowning is forbidden. Dissenters are gently corrected—or replaced.",
      "current_status": "Active; known to be influencing several small but growing spiritual communities across different regions.",
      "history": "The Smiling God was born from pure intent: a community's desire to uplift one another. Over time, this well-meaning group began worshipping a symbolic statue of joy. That belief deepened, becoming obsession, and eventually manifested the Smiling God. Their doctrine transformed into enforced positivity—happiness at any cost. Their cult has risen and collapsed multiple times across history, but they always return, drawn to hope and good will like roots to water.",
      "physical_description": "A towering figure, 7 feet tall, with a slightly chubby build and a smooth, statue-like body. Their smile is unnaturally wide and ever-present. Their head is slightly larger than proportionate, giving them a surreal, childlike yet unsettling presence. Their eyes never blink. Their surface resembles polished marble or ceramic.",
      "relationships": [
        "Occasional ideological conflict with Father Finn, though they share authoritarian structures.",
        "Rumored historical link to an early minor Olympian of celebration, now long faded."
      ]
    },
    "The_Whispering_Wind": {
      "auto_link_strings": [
        "The Whispering Wind"
      ],
      "name": "the_whispering_wind",
      "page_name": "The Whispering Wind",
      "pronouns": "she/they",
      "image_path": "../images/whispering_wind.jpg",
      "aliases": [
        "The Silent Breeze",
        "Voice of the Leaves",
        "The Invisible Guide"
      ],
      "manifestation_origin": "A secluded villiage of halflings in the Northwest Tundra that revered the wind as a messenger of nature, carrying secrets and wisdom.",
      "manifestation_vessel": "A gentle breeze that rustled through the trees, believed to be the voice of the forest itself. They Whisper to their diciples by blowing through the trees in a way that makes a rustling sound that is understandable whisper.",
      "first_appearance_time_period": "First appeared during the Age of Unity, when communication was believed to be sacred and only shared through whispers.",
      "lgbtq_identifications": [
        "nonbinary",
        "demigirl"
      ],
      "other_identifiers": [
        "empath"
      ],
      "song_name": "Whispers of the Forest",
      "song_link": "",
      "custom_details": "**Cult Behavior:** Followers communicate in hushed tones, believing that loud noises disrupt the natural order. They practice meditation and listen to the wind for guidance.",
      "current_status": "Active; known to influence environmental movements and spiritual retreats focused on harmony with nature.",
      "history": "The Whispering Wind emerged from a deep respect for nature and the belief that the wind carries the voices of the past. Over time, this belief grew into a spiritual practice, with followers seeking wisdom in the rustling leaves and gentle breezes. The Whispering Wind is seen as a guide, leading her followers to enlightenment through silence and reflection. Unlike most Fidari, she is considered benevolent even by non-followers, as her teachings promote harmony with nature and peaceful coexistence rather than zealous conversion. This rare goodwill from outsiders has allowed her influence to spread naturally through environmental movements without the typical fear and suspicion that surrounds other Fidari.",
      "physical_description": "An ethereal presence, often felt rather than seen. When they manifest, they appear as a translucent figure with flowing hair and garments and a gentle smile. Their eyes are said to reflect the sky, changing with the weather.",
      "relationships": [
        "Respected by nature spirits and often seen as a mediator between the natural and spiritual worlds."
      ]
    },
    "father_finn": {
      "auto_link_strings": [
        "Father Finn"
      ],
      "name": "father_finn",
      "page_name": "Father Finn",
      "pronouns": "he/him",
      "image_path": "../images/father_finn.jpg",
      "aliases": [
        "The Warden-God",
        "Father of Chains",
        "The Lockbearer"
      ],
      "manifestation_origin": "A high-security prison where prisoners began revering Finn's teachings of discipline and natural order as sacred doctrine.",
      "manifestation_vessel": "Originally the prison chaplain, a druid who believed humans were to be respected so long as they fulfilled their role in nature.",
      "first_appearance_time_period": "During a major revolt within the prison after inmates resisted release and elevated Finn through collective belief.",
      "lgbtq_identifications": [],
      "other_identifiers": [
        "neurodivergent"
      ],
      "song_name": "Father Finlee - Instrumental",
      "song_link": "https://www.youtube.com/watch?v=BJV83tTJKvc",
      "custom_details": "**Cult Structure:** His temple is the prison itself. Guards are clergy. Prisoners are devotees. Vines and animals flourish within as symbols of natural order. Submission and routine are seen as holy virtues.",
      "current_status": "Active and worshipped within the Sanctified Penitentiary, a self-contained prison-temple. His influence spreads slowly into reform institutions and militaristic orders.",
      "history": "Father Finn began as a druid who revered nature and believed humanity should live in harmony with its place in the world. Assigned to a brutal prison as chaplain, he became a source of strength for inmates—not through comfort, but through discipline. When prisoners resisted release, fearing the loss of structure, their belief transformed Finn into a Fidari. He now rules the penitentiary with calm authority. The harsh routines of prison life have become sacred rites. Obedience is salvation. Escape is heresy.",
      "physical_description": "A towering, muscular man standing 8 feet tall and weighing over 500 pounds. His body is scarred and heavily built. He wears garments that blend 1700s prison uniforms with clergy robes, adorned with heavy chains and silver locks—especially around his ankles. His eyes swirl with unnatural colors, reflecting the chaos and belief from which he was born. He is stoic, commanding, and never raises his voice.",
      "relationships": [
        "Ideologically opposed to the Smiling God's doctrine of joy—though both enforce order through belief.",
        "Feared and respected by many lower Fidari who lack his level of stability or infrastructure."
      ]
    },
    "maxidon": {
      "auto_link_strings": [
        "Maxidon"
      ],
      "name": "maxidon",
      "page_name": "Maxidon",
      "pronouns": "he/him",
      "image_path": "../images/maxidon.jpg",
      "aliases": [
        "The Affirmed One",
        "Manifest Ideal",
        "He Who Holds the Tablets"
      ],
      "manifestation_origin": "Tyro, within the Faithful sect—a marginalized subculture dedicated to belief-driven self-affirmation",
      "manifestation_vessel": "Twin affirmation tablets, originally mounted in a wall at the Faithful’s meeting house",
      "first_appearance_time_period": "Age of Fractures",
      "lgbtq_identifications": [],
      "other_identifiers": [
        "Fidari",
        "Constructed God",
        "Charismatic Entity"
      ],
      "song_name": "Mass Effect 3 Soundtrack - Leaving Earth",
      "song_link": "https://www.youtube.com/watch?v=KGHA9oO1Ybg",
      "custom_details": "Maxidon is the realized embodiment of the Faithful's belief in self-created salvation—a Fidari who is equal parts guru, therapist, and idealized man. He heals, uplifts, and inspires—but always with the promise that belief is the price of transformation.",
      "current_status": "Touring across Tyro and neighboring regions, gaining influence through speeches and miraculous interventions. Genuinely revered by many, cautiously tolerated by the Tyro authorities.",
      "history": "Formed when the Faithful, a fringe group in Tyro focused on self-belief and positive affirmations, concentrated their worship into a pair of inscribed stone tablets. When these tablets dislodged and fell into the arms of a new being—Maxidon—he was immediately recognized as a manifestation of their collective desire for guidance, success, and inner strength. His existence is a challenge to Tyro’s empiricist faith, despite having emerged through what some call 'controlled belief.'",
      "physical_description": "Maxidon is tall, handsome, and impeccably sculpted—orange-skinned, with a chiseled jaw, luminous pink eyes, and a magnetically reassuring voice. He appears as the idealized Tyroan man: fit, confident, wealthy in bearing. His two large hands each cradle one of the original affirmation tablets, which glow faintly when he speaks. He wears form-fitting, sleek robes that blur the line between scientific uniform and preacher’s attire.",
      "relationships": [
        "The Faithful - (origin group and current core followers)",
        "Tyroan Theocracy - (views him as a philosophical paradox and political nuisance)",
        "Other Fidari - (ambiguous; Maxidon views most with respect, but they often see him as dangerously persuasive)"
      ]
    }
  },
  "template": {
    "name": "",
    "pronouns": "",
    "image_path": "../images/",
    "aliases": [],
    "manifestation_origin": "",
    "manifestation_vessel": "",
    "first_appearance_time_period": "",
    "lgbtq_identifications": [],
    "other_identifiers": [],
    "song_name": "",
    "song_link": "",
    "custom_details": "",
    "current_status": "",
    "history": "",
    "physical_description": "",
    "relationships": []
  }
}